Loucotolo/ESP32-audioI2S/src/Audio.cpp
void Audio::initInBuff() {
  if (!InBuff.isInitialized()) {
    size_t size = InBuff.init();
    if (size > 0) {
      AUDIO_INFO(sprintf(chbuf, "PSRAM %sfound, inputBufferSize: %u bytes", InBuff.havePSRAM() ? "" : "not ", size - 1);)
    }
  }
  changeMaxBlockSize(1600); // default size mp3 or aac
}

//---------------------------------------------------------------------------------------------------------------------
esp_err_t Audio::I2Sstart(uint8_t i2s_num) {
  // It is not necessary to call this function after i2s_driver_install() (it is started automatically),
  // however it is necessary to call it after i2s_stop()
  return i2s_start((i2s_port_t) i2s_num);
}

esp_err_t Audio::I2Sstop(uint8_t i2s_num) {
  return i2s_stop((i2s_port_t) i2s_num);
}
//---------------------------------------------------------------------------------------------------------------------
esp_err_t Audio::i2s_mclk_pin_select(const uint8_t pin) {
  if (pin != 0 && pin != 1 && pin != 3) {
    log_e ("Only support GPIO0/GPIO1/GPIO3, gpio_num:%d", pin);
    return ESP_ERR_INVALID_ARG;
  }
  switch (pin) {
    case 0:
      PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO0_U, FUNC_GPIO0_CLK_OUT1);
      WRITE_PERI_REG(PIN_CTRL, 0xFFF0);
      break;
    case 1:
      PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0TXD_U, FUNC_U0TXD_CLK_OUT3);
      WRITE_PERI_REG(PIN_CTRL, 0xF0F0);
      break;
    case 3:
      PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0RXD_U, FUNC_U0RXD_CLK_OUT2);
      WRITE_PERI_REG(PIN_CTRL, 0xFF00);
      break;
    default:
      break;
  }
  return ESP_OK;
}
//---------------------------------------------------------------------------------------------------------------------
Audio::~Audio() {
  //I2Sstop(m_i2s_num);
  //InBuff.~AudioBuffer(); #215 the AudioBuffer is automatically destroyed by the destructor
  setDefaults();
  if (m_playlistBuff) {
    free(m_playlistBuff);
    m_playlistBuff = NULL;
  }
  i2s_driver_uninstall((i2s_port_t)m_i2s_num); // #215 free I2S buffer
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::setDefaults() {
  stopSong();
  initInBuff(); // initialize InputBuffer if not already done
  InBuff.resetBuffer();
  MP3Decoder_FreeBuffers();
  FLACDecoder_FreeBuffers();
  if (!m_f_m3u8data) AACDecoder_FreeBuffers();
  if (!m_f_m3u8data) if (m_playlistBuff) {
      free(m_playlistBuff);  // free if not m3u8
      m_playlistBuff = NULL;
    }
  client.stop();
  client.flush(); // release memory
  clientsecure.stop();
  clientsecure.flush();
  _client = static_cast<WiFiClient*>(&clientsecure); /* default to *something* so that no NULL deref can happen */
  playI2Sremains();

  AUDIO_INFO(sprintf(chbuf, "buffers freed, free Heap: %u bytes", ESP.getFreeHeap());)

  m_f_chunked = false;                                    // Assume not chunked
  m_f_ctseen = false;                                     // Contents type not seen yet
  m_f_firstmetabyte = false;
  m_f_playing = false;
  m_f_ssl = false;
  m_f_swm = true;                                         // Assume no metaint (stream without metadata)
  m_f_webfile = false;                                    // Assume radiostream (connecttohost)
  m_f_firstCall = true;                                   // InitSequence for processWebstream and processLokalFile
  m_f_running = false;
  m_f_loop = false;                                       // Set if audio file should loop
  m_f_unsync = false;                                     // set within ID3 tag but not used
  m_f_exthdr = false;                                     // ID3 extended header
  m_f_rtsp = false;                                       // RTSP (m3u8)stream
  m_f_m3u8data = false;                                   // set again in processM3U8entries() if necessary
  m_f_Log = true;                                         // logging always allowed

  m_codec = CODEC_NONE;
  m_playlistFormat = FORMAT_NONE;
  m_datamode = AUDIO_NONE;
  m_audioCurrentTime = 0;                                 // Reset playtimer
  m_audioFileDuration = 0;
  m_audioDataStart = 0;
  m_audioDataSize = 0;
  m_avr_bitrate = 0;                                      // the same as m_bitrate if CBR, median if VBR
  m_bitRate = 0;                                          // Bitrate still unknown

  m_chunkcount = 0;                                       // for chunked streams
  m_contentlength = 0;                                    // If Content-Length is known, count it
  m_curSample = 0;
  m_metaint = 0;                                          // No metaint yet
  m_LFcount = 0;                                          // For end of header detection
  m_controlCounter = 0;                                   // Status within readID3data() and readWaveHeader()
  m_channels = 2;                                         // assume stereo #209
  m_streamTitleHash = 0;


  //TEST loop
  m_file_size = 0;
  //TEST loop
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::httpPrint(const char* url) {

  // call to a new subdomain or if no connection is present connect first

  char* host = NULL;
  const char* extension; /* not modified */
  char resp[256 + 100];
  uint8_t p1 = 0, p2 = 0;

  if (startsWith(url, "http")) {
    if (m_f_ssl) p1 = 8;
    else p1 = 7;
  }

  p2 = indexOf(url, "/", p1);
  host = strndup(url + p1, p2 - p1);

  extension = url + p2 + 1;

  //    log_i("host %s", host);
  //    log_i("extension %s", extension);

  resp[0] = '\0';
  strcat(resp, "GET /");
  strcat(resp, extension);
  strcat(resp, " HTTP/1.1\r\n");
  strcat(resp, "Host: ");
  strcat(resp,  host);
  strcat(resp, "\r\nUser-Agent: ESP32 audioI2S\r\n");
  strcat(resp, "icy-metadata: 1\r\n");
  strcat(resp, "Accept-Encoding: identity\r\n");
  strcat(resp, "Connection: Keep-Alive\r\n\r\n");

  int pos_colon     = indexOf(host, ":", 0);
  int pos_ampersand = indexOf(host, "&", 0);
  int port = 80;
  if (m_f_ssl) port = 443;

  if ((pos_colon >= 0) && ((pos_ampersand == -1) or (pos_ampersand > pos_colon))) {
    port = atoi(host + pos_colon + 1);// Get portnumber as integer
    host[pos_colon] = '\0';// Host without portnumber
  }

  if (!_client->connected()) {
    if (m_f_Log) sprintf(chbuf, "new connection, host=%s, extension=%s, port=%i", host, extension, port);
    if (m_f_Log) if (audio_info) audio_info(chbuf);
    _client->connect(host, port);
    if (m_f_m3u8data && m_playlistBuff) strcpy(m_playlistBuff, url); // save new m3u8 chunklist
  }
  _client->print(resp);

