Loucotolo/ESP32-audioI2S/src/Audio.cpp
  if (host)      {
    free(host);
    host = NULL;
  }

  strcpy(m_lastHost, url);

  return;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::connecttohost(const char* host, bool mp3local, const char* user, const char* pwd) {
  // user and pwd for authentification only, can be empty

  if (mp3local != true) {
    prebuffer = 200;
  }
  localmp3 = mp3local;





  char* l_host = NULL; // local copy of host
  char* h_host = NULL; // pointer of l_host without http:// or https://


  if (strlen(host) == 0) {
    if (audio_info) audio_info("Hostaddress is empty");
    return false;
  }

  if (strlen(host) >= 512 - 10) {
    if (audio_info) audio_info("Hostaddress is too long");
    return false;
  }

  l_host = (char*)malloc(strlen(host) + 10);
  strcpy(l_host, host);
  trim(l_host);
  int p = indexOf(l_host, "http", 0);
  if (p > 0) {
    if (audio_info) audio_info("Hostaddress is wrong");
    if (l_host) {
      free(l_host);
      l_host = NULL;
    }
    return false;
  }
  if (p < 0) { // http not found, shift right +7, then insert http://
    for (int i = strlen(l_host) + 1; i >= 0; i--) {
      l_host[i + 7] = l_host[i];
    }
    memcpy(l_host, "http://", 7);
  }

  setDefaults();

  AUDIO_INFO(sprintf(chbuf, "Connect to new host: \"%s\"", l_host);)

  // authentification
  uint8_t auth = strlen(user) + strlen(pwd);
  char toEncode[auth + 4];
  toEncode[0] = '\0';
  strcat(toEncode, user);
  strcat(toEncode, ":");
  strcat(toEncode, pwd);
  char authorization[base64_encode_expected_len(strlen(toEncode)) + 1];
  authorization[0] = '\0';
  b64encode((const char*)toEncode, strlen(toEncode), authorization);

  // initializationsequence
  int16_t pos_slash;                                        // position of "/" in hostname
  int16_t pos_colon;                                        // position of ":" in hostname
  int16_t pos_ampersand;                                    // position of "&" in hostname
  uint16_t port = 80;                                       // port number
  setDatamode(AUDIO_HEADER);                                // Handle header

  h_host = l_host;

  if (startsWith(l_host, "http://")) {
    h_host += 7;
    m_f_ssl = false;
    _client = static_cast<WiFiClient*>(&client);
  }

  if (startsWith(l_host, "https://")) {
    h_host += 8;
    m_f_ssl = true;
    port = 443;
    _client = static_cast<WiFiClient*>(&clientsecure);

  }

  // Is it a playlist?
  if (endsWith(h_host, ".m3u" ))       {
    m_playlistFormat = FORMAT_M3U;
    m_datamode = AUDIO_PLAYLISTINIT;
  }
  if (endsWith(h_host, ".pls" ))       {
    m_playlistFormat = FORMAT_PLS;
    m_datamode = AUDIO_PLAYLISTINIT;
  }
  if (endsWith(h_host, ".asx" ))       {
    m_playlistFormat = FORMAT_ASX;
    m_datamode = AUDIO_PLAYLISTINIT;
  }
  // if url ...=asx   www.fantasyfoxradio.de/infusions/gr_radiostatus_panel/gr_radiostatus_player.php?id=2&p=asx
  if (endsWith(h_host, "=asx" ))       {
    m_playlistFormat = FORMAT_ASX;
    m_datamode = AUDIO_PLAYLISTINIT;
  }
  if (endsWith(h_host, "=pls" ))       {
    m_playlistFormat = FORMAT_PLS;
    m_datamode = AUDIO_PLAYLISTINIT;
  }
  // if url  "http://n3ea-e2.revma.ihrhls.com/zc7729/hls.m3u8?rj-ttl=5&rj-tok=AAABe8unpPAAyu36Dkm0J4mzJg"
  if (indexOf(h_host, ".m3u8", 0) > 10) {
    m_playlistFormat = FORMAT_M3U8;
    m_datamode = AUDIO_PLAYLISTINIT;
  }

  // In the URL there may be an extension, like noisefm.ru:8000/play.m3u&t=.m3u
  pos_slash     = indexOf(h_host, "/", 0);
  pos_colon     = indexOf(h_host, ":", 0);
  pos_ampersand = indexOf(h_host, "&", 0);

  char *hostwoext = NULL;                                  // "skonto.ls.lv:8002" in "skonto.ls.lv:8002/mp3"
  char *extension = NULL;                                  // "/mp3" in "skonto.ls.lv:8002/mp3"

  if (pos_slash > 1) {
    uint8_t hostwoextLen = pos_slash;
    hostwoext = (char*)malloc(hostwoextLen + 1);
    memcpy(hostwoext, h_host, hostwoextLen);
    hostwoext[hostwoextLen] = '\0';
    uint16_t extLen =  urlencode_expected_len(h_host + pos_slash);
    extension = (char *)malloc(extLen);
    memcpy(extension, h_host + pos_slash, extLen);
    trim(extension);
    urlencode(extension, extLen, true);
  }
  else { // url has no extension
    hostwoext = strdup(h_host);
    extension = strdup("/");
  }

  if ((pos_colon >= 0) && ((pos_ampersand == -1) or (pos_ampersand > pos_colon))) {
    port = atoi(h_host + pos_colon + 1);// Get portnumber as integer
    hostwoext[pos_colon] = '\0';// Host without portnumber
  }

  AUDIO_INFO(sprintf(chbuf, "Connect to \"%s\" on port %d, extension \"%s\"", hostwoext, port, extension);)

  char resp[strlen(h_host) + strlen(authorization) + 100];
  resp[0] = '\0';

  strcat(resp, "GET ");
  strcat(resp, extension);
  strcat(resp, " HTTP/1.0\r\n");
  strcat(resp, "Host: ");
  strcat(resp, hostwoext);
  strcat(resp, "\r\n");
  strcat(resp, "Icy-MetaData:1\r\n");
  strcat(resp, "Authorization: Basic ");
  strcat(resp, authorization);
  strcat(resp, "\r\n");
  strcat(resp, "User-Agent: Mozilla/5.0\r\n");
  //    strcat(resp, "Accept-Encoding: gzip;q=0\r\n");  // otherwise the server assumes gzip compression
  //    strcat(resp, "Transfer-Encoding: \r\n");  // otherwise the server assumes gzip compression
  strcat(resp, "Connection: keep-alive\r\n\r\n");
  const uint32_t TIMEOUT_MS{5000};
  const uint32_t TIMEOUT_MS_SSL{5000};

  uint32_t t = millis();
  if (_client->connect(hostwoext, port, m_f_ssl ? TIMEOUT_MS_SSL : TIMEOUT_MS)) {
    if(!m_f_ssl) _client->setNoDelay(true);
    // if(audio_info) audio_info("SSL/TLS Connected to server");
    _client->print(resp);
    uint32_t dt = millis() - t;
    sprintf(chbuf, "%s has been established in %u ms, free Heap: %u bytes", m_f_ssl ? "SSL" : "Connection", dt, ESP.getFreeHeap());
    if (audio_info) audio_info(chbuf);
    strcpy(m_lastHost, l_host);
    m_f_running = true;
    if (hostwoext) {
      free(hostwoext);
      hostwoext = NULL;
    }
    if (extension) {
      free(extension);
      extension = NULL;
    }
    if (l_host   ) {
      free(l_host);
      l_host    = NULL;
    }
    while (!_client->connected()) {
      ; // wait until the connection is established
    }
    return true;
  }


  sprintf(chbuf, "Request %s failed!", l_host);
  if (audio_fail_stream) audio_fail_stream(chbuf);
  if (audio_showstation) audio_showstation("");
  if (audio_showstreamtitle) audio_showstreamtitle("");
  if (audio_icydescription) audio_icydescription("");
  if (audio_icyurl) audio_icyurl("");
  m_lastHost[0] = 0;
  if (hostwoext) {
    free(hostwoext);
    hostwoext = NULL;
  }
  if (extension) {
    free(extension);
    extension = NULL;
  }
  if (l_host   ) {
    free(l_host);
    l_host    = NULL;
  }
  return false;
}


