Loucotolo/ESP32-audioI2S/src/Audio.cpp
//---------------------------------------------------------------------------------------------------------------------
void Audio::urlencode(char* buff, uint16_t buffLen, bool spacesOnly) {

  uint16_t len = strlen(buff);
  uint8_t* tmpbuff = (uint8_t*)malloc(buffLen);
  if (!tmpbuff) {
    log_e("out of memory");
    return;
  }
  char c;
  char code0;
  char code1;
  uint16_t j = 0;
  for (int i = 0; i < len; i++) {
    c = buff[i];
    if (isalnum(c)) tmpbuff[j++] = c;
    else if (spacesOnly) {
      if (c == ' ') {
        tmpbuff[j++] = '%';
        tmpbuff[j++] = '2';
        tmpbuff[j++] = '0';
      }
      else {
        tmpbuff[j++] = c;
      }
    }
    else {
      code1 = (c & 0xf) + '0';
      if ((c & 0xf) > 9) code1 = (c & 0xf) - 10 + 'A';
      c = (c >> 4) & 0xf;
      code0 = c + '0';
      if (c > 9) code0 = c - 10 + 'A';
      tmpbuff[j++] = '%';
      tmpbuff[j++] = code0;
      tmpbuff[j++] = code1;
    }
    if (j == buffLen - 1) {
      log_e("out of memory");
      break;
    }
  }
  memcpy(buff, tmpbuff, j);
  buff[j] = '\0';
  free(tmpbuff);
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::showID3Tag(const char* tag, const char* value) {

  chbuf[0] = 0;
  // V2.2
  if (!strcmp(tag, "CNT")) sprintf(chbuf, "Play counter: %s", value);
  // if(!strcmp(tag, "COM")) sprintf(chbuf, "Comments: %s", value);
  if (!strcmp(tag, "CRA")) sprintf(chbuf, "Audio encryption: %s", value);
  if (!strcmp(tag, "CRM")) sprintf(chbuf, "Encrypted meta frame: %s", value);
  if (!strcmp(tag, "ETC")) sprintf(chbuf, "Event timing codes: %s", value);
  if (!strcmp(tag, "EQU")) sprintf(chbuf, "Equalization: %s", value);
  if (!strcmp(tag, "IPL")) sprintf(chbuf, "Involved people list: %s", value);
  if (!strcmp(tag, "PIC")) sprintf(chbuf, "Attached picture: %s", value);
  if (!strcmp(tag, "SLT")) sprintf(chbuf, "Synchronized lyric/text: %s", value);
  // if(!strcmp(tag, "TAL")) sprintf(chbuf, "Album/Movie/Show title: %s", value);
  if (!strcmp(tag, "TBP")) sprintf(chbuf, "BPM (Beats Per Minute): %s", value);
  if (!strcmp(tag, "TCM")) sprintf(chbuf, "Composer: %s", value);
  if (!strcmp(tag, "TCO")) sprintf(chbuf, "Content type: %s", value);
  if (!strcmp(tag, "TCR")) sprintf(chbuf, "Copyright message: %s", value);
  if (!strcmp(tag, "TDA")) sprintf(chbuf, "Date: %s", value);
  if (!strcmp(tag, "TDY")) sprintf(chbuf, "Playlist delay: %s", value);
  if (!strcmp(tag, "TEN")) sprintf(chbuf, "Encoded by: %s", value);
  if (!strcmp(tag, "TFT")) sprintf(chbuf, "File type: %s", value);
  if (!strcmp(tag, "TIM")) sprintf(chbuf, "Time: %s", value);
  if (!strcmp(tag, "TKE")) sprintf(chbuf, "Initial key: %s", value);
  if (!strcmp(tag, "TLA")) sprintf(chbuf, "Language(s): %s", value);
  if (!strcmp(tag, "TLE")) sprintf(chbuf, "Length: %s", value);
  if (!strcmp(tag, "TMT")) sprintf(chbuf, "Media type: %s", value);
  if (!strcmp(tag, "TOA")) sprintf(chbuf, "Original artist(s)/performer(s): %s", value);
  if (!strcmp(tag, "TOF")) sprintf(chbuf, "Original filename: %s", value);
  if (!strcmp(tag, "TOL")) sprintf(chbuf, "Original Lyricist(s)/text writer(s): %s", value);
  if (!strcmp(tag, "TOR")) sprintf(chbuf, "Original release year: %s", value);
  if (!strcmp(tag, "TOT")) sprintf(chbuf, "Original album/Movie/Show title: %s", value);
  if (!strcmp(tag, "TP1")) sprintf(chbuf, "Lead artist(s)/Lead performer(s)/Soloist(s)/Performing group: %s", value);
  if (!strcmp(tag, "TP2")) sprintf(chbuf, "Band/Orchestra/Accompaniment: %s", value);
  if (!strcmp(tag, "TP3")) sprintf(chbuf, "Conductor/Performer refinement: %s", value);
  if (!strcmp(tag, "TP4")) sprintf(chbuf, "Interpreted, remixed, or otherwise modified by: %s", value);
  if (!strcmp(tag, "TPA")) sprintf(chbuf, "Part of a set: %s", value);
  if (!strcmp(tag, "TPB")) sprintf(chbuf, "Publisher: %s", value);
  if (!strcmp(tag, "TRC")) sprintf(chbuf, "ISRC (International Standard Recording Code): %s", value);
  if (!strcmp(tag, "TRD")) sprintf(chbuf, "Recording dates: %s", value);
  if (!strcmp(tag, "TRK")) sprintf(chbuf, "Track number/Position in set: %s", value);
  if (!strcmp(tag, "TSI")) sprintf(chbuf, "Size: %s", value);
  if (!strcmp(tag, "TSS")) sprintf(chbuf, "Software/hardware and settings used for encoding: %s", value);
  if (!strcmp(tag, "TT1")) sprintf(chbuf, "Content group description: %s", value);
  if (!strcmp(tag, "TT2")) sprintf(chbuf, "Title/Songname/Content description: %s", value);
  if (!strcmp(tag, "TT3")) sprintf(chbuf, "Subtitle/Description refinement: %s", value);
  if (!strcmp(tag, "TXT")) sprintf(chbuf, "Lyricist/text writer: %s", value);
  if (!strcmp(tag, "TXX")) sprintf(chbuf, "User defined text information frame: %s", value);
  if (!strcmp(tag, "TYE")) sprintf(chbuf, "Year: %s", value);
  if (!strcmp(tag, "UFI")) sprintf(chbuf, "Unique file identifier: %s", value);
  if (!strcmp(tag, "ULT")) sprintf(chbuf, "Unsychronized lyric/text transcription: %s", value);
  if (!strcmp(tag, "WAF")) sprintf(chbuf, "Official audio file webpage: %s", value);
  if (!strcmp(tag, "WAR")) sprintf(chbuf, "Official artist/performer webpage: %s", value);
  if (!strcmp(tag, "WAS")) sprintf(chbuf, "Official audio source webpage: %s", value);
  if (!strcmp(tag, "WCM")) sprintf(chbuf, "Commercial information: %s", value);
  if (!strcmp(tag, "WCP")) sprintf(chbuf, "Copyright/Legal information: %s", value);
  if (!strcmp(tag, "WPB")) sprintf(chbuf, "Publishers official webpage: %s", value);
  if (!strcmp(tag, "WXX")) sprintf(chbuf, "User defined URL link frame: %s", value);

  // V2.3 V2.4 tags
  // if(!strcmp(tag, "COMM")) sprintf(chbuf, "Comment: %s", value);
  if (!strcmp(tag, "OWNE")) sprintf(chbuf, "Ownership: %s", value);
  // if(!strcmp(tag, "PRIV")) sprintf(chbuf, "Private: %s", value);
  if (!strcmp(tag, "SYLT")) sprintf(chbuf, "SynLyrics: %s", value);
  if (!strcmp(tag, "TALB")) sprintf(chbuf, "Album: %s", value);
  if (!strcmp(tag, "TBPM")) sprintf(chbuf, "BeatsPerMinute: %s", value);
  if (!strcmp(tag, "TCMP")) sprintf(chbuf, "Compilation: %s", value);
  if (!strcmp(tag, "TCOM")) sprintf(chbuf, "Composer: %s", value);
  if (!strcmp(tag, "TCON")) sprintf(chbuf, "ContentType: %s", value);
  if (!strcmp(tag, "TCOP")) sprintf(chbuf, "Copyright: %s", value);
  if (!strcmp(tag, "TDAT")) sprintf(chbuf, "Date: %s", value);
  if (!strcmp(tag, "TEXT")) sprintf(chbuf, "Lyricist: %s", value);
  if (!strcmp(tag, "TIME")) sprintf(chbuf, "Time: %s", value);
  if (!strcmp(tag, "TIT1")) sprintf(chbuf, "Grouping: %s", value);
  if (!strcmp(tag, "TIT2")) sprintf(chbuf, "Title: %s", value);
  if (!strcmp(tag, "TIT3")) sprintf(chbuf, "Subtitle: %s", value);
  if (!strcmp(tag, "TLAN")) sprintf(chbuf, "Language: %s", value);
  if (!strcmp(tag, "TLEN")) sprintf(chbuf, "Length (ms): %s", value);
  if (!strcmp(tag, "TMED")) sprintf(chbuf, "Media: %s", value);
  if (!strcmp(tag, "TOAL")) sprintf(chbuf, "OriginalAlbum: %s", value);
  if (!strcmp(tag, "TOPE")) sprintf(chbuf, "OriginalArtist: %s", value);
  if (!strcmp(tag, "TORY")) sprintf(chbuf, "OriginalReleaseYear: %s", value);
  if (!strcmp(tag, "TPE1")) sprintf(chbuf, "Artist: %s", value);
  if (!strcmp(tag, "TPE2")) sprintf(chbuf, "Band: %s", value);
  if (!strcmp(tag, "TPE3")) sprintf(chbuf, "Conductor: %s", value);
  if (!strcmp(tag, "TPE4")) sprintf(chbuf, "InterpretedBy: %s", value);
  if (!strcmp(tag, "TPOS")) sprintf(chbuf, "PartOfSet: %s", value);
  if (!strcmp(tag, "TPUB")) sprintf(chbuf, "Publisher: %s", value);
  if (!strcmp(tag, "TRCK")) sprintf(chbuf, "Track: %s", value);
  if (!strcmp(tag, "TSSE")) sprintf(chbuf, "SettingsForEncoding: %s", value);
  if (!strcmp(tag, "TRDA")) sprintf(chbuf, "RecordingDates: %s", value);
  if (!strcmp(tag, "TXXX")) sprintf(chbuf, "UserDefinedText: %s", value);
  if (!strcmp(tag, "TYER")) sprintf(chbuf, "Year: %s", value);
  if (!strcmp(tag, "USER")) sprintf(chbuf, "TermsOfUse: %s", value);
  if (!strcmp(tag, "USLT")) sprintf(chbuf, "Lyrics: %s", value);
  if (!strcmp(tag, "WOAR")) sprintf(chbuf, "OfficialArtistWebpage: %s", value);
  if (!strcmp(tag, "XDOR")) sprintf(chbuf, "OriginalReleaseTime: %s", value);

  latinToUTF8(chbuf, sizeof(chbuf));
  if (chbuf[0] != 0) if (audio_id3data) audio_id3data(chbuf);
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::unicode2utf8(char* buff, uint32_t len) {
  // converts unicode in UTF-8, buff contains the string to be converted up to len
  // range U+1 ... U+FFFF
  uint8_t* tmpbuff = (uint8_t*)malloc(len * 2);
  if (!tmpbuff) {
    log_e("out of memory");
    return;
  }
  bool bitorder = false;
  uint16_t j = 0;
  uint16_t k = 0;
  uint16_t m = 0;
  uint8_t uni_h = 0;
  uint8_t uni_l = 0;

