Loucotolo/ESP32-audioI2S/src/Audio.cpp
  while (m < len - 1) {
    if ((buff[m] == 0xFE) && (buff[m + 1] == 0xFF)) {
      bitorder = true;
      j = m + 2;
    }  // LSB/MSB
    if ((buff[m] == 0xFF) && (buff[m + 1] == 0xFE)) {
      bitorder = false;
      j = m + 2;
    }  // MSB/LSB
    m++;
  } // seek for last bitorder
  m = 0;
  if (j > 0) {
    for (k = j; k < len; k += 2) {
      if (bitorder == true) {
        uni_h = (uint8_t)buff[k];
        uni_l = (uint8_t)buff[k + 1];
      }
      else {
        uni_l = (uint8_t)buff[k];
        uni_h = (uint8_t)buff[k + 1];
      }

      uint16_t uni_hl = ((uni_h << 8) | uni_l);

      if (uni_hl < 0X80) {
        tmpbuff[m] = uni_l;
        m++;
      }
      else if (uni_hl < 0X800) {
        tmpbuff[m] = ((uni_hl >> 6) | 0XC0);
        m++;
        tmpbuff[m] = ((uni_hl & 0X3F) | 0X80);
        m++;
      }
      else {
        tmpbuff[m] = ((uni_hl >> 12) | 0XE0);
        m++;
        tmpbuff[m] = (((uni_hl >> 6) & 0X3F) | 0X80);
        m++;
        tmpbuff[m] = ((uni_hl & 0X3F) | 0X80);
        m++;
      }
    }
  }
  buff[m] = 0;
  memcpy(buff, tmpbuff, m);
  free(tmpbuff);
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::latinToUTF8(char* buff, size_t bufflen) {
  // most stations send  strings in UTF-8 but a few sends in latin. To standardize this, all latin strings are
  // converted to UTF-8. If UTF-8 is already present, nothing is done and true is returned.
  // A conversion to UTF-8 extends the string. Therefore it is necessary to know the buffer size. If the converted
  // string does not fit into the buffer, false is returned
  // utf8 bytelength: >=0xF0 3 bytes, >=0xE0 2 bytes, >=0xC0 1 byte, e.g. e293ab is ⓫

  uint16_t pos = 0;
  uint8_t  ext_bytes = 0;
  uint16_t len = strlen(buff);
  uint8_t  c;

  while (pos < len) {
    c = buff[pos];
    if (c >= 0xC2) {   // is UTF8 char
      pos++;
      if (c >= 0xC0 && buff[pos] < 0x80) {
        ext_bytes++;
        pos++;
      }
      if (c >= 0xE0 && buff[pos] < 0x80) {
        ext_bytes++;
        pos++;
      }
      if (c >= 0xF0 && buff[pos] < 0x80) {
        ext_bytes++;
        pos++;
      }
    }
    else pos++;
  }
  if (!ext_bytes) return true; // is UTF-8, do nothing

  pos = 0;

  while (buff[pos] != 0) {
    len = strlen(buff);
    if (buff[pos] >= 0x80 && buff[pos + 1] < 0x80) {   // is not UTF8, is latin?
      for (int i = len + 1; i > pos; i--) {
        buff[i + 1] = buff[i];
      }
      uint8_t c = buff[pos];
      buff[pos++] = 0xc0 | ((c >> 6) & 0x1f);      // 2+1+5 bits
      buff[pos++] = 0x80 | ((char)c & 0x3f);       // 1+1+6 bits
    }
    pos++;
    if (pos > bufflen - 3) {
      buff[bufflen - 1] = '\0';
      return false; // do not overwrite
    }
  }
  return true;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::read_WAV_Header(uint8_t* data, size_t len) {
  static size_t headerSize;
  static uint32_t cs = 0;
  static uint8_t bts = 0;

  if (m_controlCounter == 0) {
    m_controlCounter ++;
    if ((*data != 'R') || (*(data + 1) != 'I') || (*(data + 2) != 'F') || (*(data + 3) != 'F')) {
      if (audio_info) audio_info("file has no RIFF tag");
      headerSize = 0;
      return -1; //false;
    }
    else {
      headerSize = 4;
      return 4; // ok
    }
  }

  if (m_controlCounter == 1) {
    m_controlCounter ++;
    cs = (uint32_t) (*data + (*(data + 1) << 8) + (*(data + 2) << 16) + (*(data + 3) << 24) - 8);
    headerSize += 4;
    return 4; // ok
  }

  if (m_controlCounter == 2) {
    m_controlCounter ++;
    if ((*data  != 'W') || (*(data + 1) != 'A') || (*(data + 2) != 'V') || (*(data + 3) != 'E')) {
      if (audio_info) audio_info("format tag is not WAVE");
      return -1;//false;
    }
    else {
      headerSize += 4;
      return 4;
    }
  }

  if (m_controlCounter == 3) {
    if ((*data  == 'f') && (*(data + 1) == 'm') && (*(data + 2) == 't')) {
      m_controlCounter ++;
      headerSize += 4;
      return 4;
    }
    else {
      headerSize += 4;
      return 4;
    }
  }

  if (m_controlCounter == 4) {
    m_controlCounter ++;
    cs = (uint32_t) (*data + (*(data + 1) << 8));
    if (cs > 40) return -1; //false, something going wrong
    bts = cs - 16; // bytes to skip if fmt chunk is >16
    headerSize += 4;
    return 4;
  }

  if (m_controlCounter == 5) {
    m_controlCounter ++;
    uint16_t fc  = (uint16_t) (*(data + 0)  + (*(data + 1)  << 8));         // Format code
    uint16_t nic = (uint16_t) (*(data + 2)  + (*(data + 3)  << 8));         // Number of interleaved channels
    uint32_t sr  = (uint32_t) (*(data + 4)  + (*(data + 5)  << 8) +
                               (*(data + 6)  << 16) + (*(data + 7)  << 24)); // Samplerate
    uint32_t dr  = (uint32_t) (*(data + 8)  + (*(data + 9)  << 8) +
                               (*(data + 10) << 16) + (*(data + 11) << 24)); // Datarate
    uint16_t dbs = (uint16_t) (*(data + 12) + (*(data + 13) << 8));         // Data block size
    uint16_t bps = (uint16_t) (*(data + 14) + (*(data + 15) << 8));         // Bits per sample
    if (audio_info) {
      sprintf(chbuf, "FormatCode: %u", fc);     audio_info(chbuf);
      //    sprintf(chbuf, "Channel: %u", nic);       audio_info(chbuf);
      //    sprintf(chbuf, "SampleRate: %u", sr);     audio_info(chbuf);
      sprintf(chbuf, "DataRate: %u", dr);       audio_info(chbuf);
      sprintf(chbuf, "DataBlockSize: %u", dbs); audio_info(chbuf);
      //    sprintf(chbuf, "BitsPerSample: %u", bps); audio_info(chbuf);
    }
    if ((bps != 8) && (bps != 16)) {
      AUDIO_INFO(sprintf(chbuf, "BitsPerSample is %u,  must be 8 or 16" , bps);)
      stopSong();
      return -1;
    }
    if ((nic != 1) && (nic != 2)) {
      AUDIO_INFO(sprintf(chbuf, "num channels is %u,  must be 1 or 2" , nic); audio_info(chbuf);)
      stopSong();
      return -1;
    }
    if (fc != 1) {
      if (audio_info) audio_info("format code is not 1 (PCM)");
      stopSong();
      return -1 ; //false;
    }
    setBitsPerSample(bps);
    setChannels(nic);
    setSampleRate(sr);
    setBitrate(nic * sr * bps);
    //    sprintf(chbuf, "BitRate: %u", m_bitRate);
    //    if(audio_info) audio_info(chbuf);
    headerSize += 16;
    return 16; // ok
  }

  if (m_controlCounter == 6) {
    m_controlCounter ++;
    headerSize += bts;
    return bts; // skip to data
  }

  if (m_controlCounter == 7) {
    if ((*(data + 0) == 'd') && (*(data + 1) == 'a') && (*(data + 2) == 't') && (*(data + 3) == 'a')) {
      m_controlCounter ++;
      vTaskDelay(30);
      headerSize += 4;
      return 4;
    }
    else {
      headerSize ++;
      return 1;
    }
  }

  if (m_controlCounter == 8) {
    m_controlCounter ++;
    size_t cs =  *(data + 0) + (*(data + 1) << 8) + (*(data + 2) << 16) + (*(data + 3) << 24); //read chunkSize
    headerSize += 4;

