Loucotolo/ESP32-audioI2S/src/Audio.cpp
    if (cs) {
      m_audioDataSize = cs  - 44;
    }
    else { // sometimes there is nothing here
      if (m_f_webfile) m_audioDataSize = m_contentlength - headerSize;
    }
    AUDIO_INFO(sprintf(chbuf, "Audio-Length: %u", m_audioDataSize);)
    return 4;
  }
  m_controlCounter = 100; // header succesfully read
  m_audioDataStart = headerSize;
  return 0;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::read_FLAC_Header(uint8_t *data, size_t len) {
  static size_t headerSize;
  static size_t retvalue;
  static bool   f_lastMetaBlock;

  if (retvalue) {
    if (retvalue > len) { // if returnvalue > bufferfillsize
      if (len > InBuff.getMaxBlockSize()) len = InBuff.getMaxBlockSize();
      retvalue -= len; // and wait for more bufferdata
      return len;
    }
    else {
      size_t tmp = retvalue;
      retvalue = 0;
      return tmp;
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_BEGIN) { // init
    headerSize = 0;
    retvalue = 0;
    m_audioDataStart = 0;
    f_lastMetaBlock = false;
    m_controlCounter = FLAC_MAGIC;

    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_MAGIC) { /* check MAGIC STRING */
    if (specialIndexOf(data, "fLaC", 10) != 0) {
      log_e("Magic String 'fLaC' not found in header");
      stopSong();
      return -1;
    }
    //        log_i("Magig String found");
    m_controlCounter = FLAC_MBH;
    headerSize = 4;
    retvalue = 4;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_MBH) { /* METADATA_BLOCK_HEADER */
    uint8_t blockType = *data;
    if (!f_lastMetaBlock) {
      if (blockType & 128) {
        f_lastMetaBlock = true;
      }
      blockType &= 127;
      if (blockType == 0) m_controlCounter = FLAC_SINFO;
      if (blockType == 1) m_controlCounter = FLAC_PADDING;
      if (blockType == 2) m_controlCounter = FLAC_APP;
      if (blockType == 3) m_controlCounter = FLAC_SEEK;
      if (blockType == 4) m_controlCounter = FLAC_VORBIS;
      if (blockType == 5) m_controlCounter = FLAC_CUESHEET;
      if (blockType == 6) m_controlCounter = FLAC_PICTURE;
      headerSize += 1;
      retvalue = 1;
      return 0;
    }
    m_controlCounter = FLAC_OKAY;
    m_audioDataStart = headerSize;
    m_audioDataSize = m_contentlength - m_audioDataStart;
    AUDIO_INFO(sprintf(chbuf, "Audio-Length: %u", m_audioDataSize);)
    retvalue = 0;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_SINFO) { /* Stream info block */
    size_t l = bigEndian(data, 3);
    vTaskDelay(2);
    m_flacMaxBlockSize = bigEndian(data + 5, 2);
    AUDIO_INFO(sprintf(chbuf, "FLAC maxBlockSize: %u", m_flacMaxBlockSize);)
    vTaskDelay(2);
    m_flacMaxFrameSize = bigEndian(data + 10, 3);
    if (m_flacMaxFrameSize) {
      AUDIO_INFO(sprintf(chbuf, "FLAC maxFrameSize: %u", m_flacMaxFrameSize);)
    }
    else {
      if (audio_info) audio_info("FLAC maxFrameSize: N/A");
    }
    if (m_flacMaxFrameSize > InBuff.getMaxBlockSize()) {
      log_e("FLAC maxFrameSize too large!");
      stopSong();
      return -1;
    }
    //        InBuff.changeMaxBlockSize(m_flacMaxFrameSize);
    vTaskDelay(2);
    uint32_t nextval = bigEndian(data + 13, 3);
    m_flacSampleRate = nextval >> 4;
    AUDIO_INFO(sprintf(chbuf, "FLAC sampleRate: %u", m_flacSampleRate);)
    vTaskDelay(2);
    m_flacNumChannels = ((nextval & 0x06) >> 1) + 1;
    AUDIO_INFO(sprintf(chbuf, "FLAC numChannels: %u", m_flacNumChannels);)
    vTaskDelay(2);
    uint8_t bps = (nextval & 0x01) << 4;
    bps += (*(data + 16) >> 4) + 1;
    m_flacBitsPerSample = bps;
    if ((bps != 8) && (bps != 16)) {
      log_e("bits per sample must be 8 or 16, is %i", bps);
      stopSong();
      return -1;
    }
    AUDIO_INFO(sprintf(chbuf, "FLAC bitsPerSample: %u", m_flacBitsPerSample);)
    m_flacTotalSamplesInStream = bigEndian(data + 17, 4);
    if (m_flacTotalSamplesInStream) {
      AUDIO_INFO(sprintf(chbuf, "total samples in stream: %u", m_flacTotalSamplesInStream);)
    }
    else {
      if (audio_info) audio_info("total samples in stream: N/A");
    }
    if (bps != 0 && m_flacTotalSamplesInStream) {
      AUDIO_INFO(sprintf(chbuf, "audio file duration: %u seconds", m_flacTotalSamplesInStream / m_flacSampleRate);)
    }
    m_controlCounter = FLAC_MBH; // METADATA_BLOCK_HEADER
    retvalue = l + 3;
    headerSize += retvalue;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_PADDING) { /* PADDING */
    size_t l = bigEndian(data, 3);
    m_controlCounter = FLAC_MBH;
    retvalue = l + 3;
    headerSize += retvalue;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_APP) { /* APPLICATION */
    size_t l = bigEndian(data, 3);
    m_controlCounter = FLAC_MBH;
    retvalue = l + 3;
    headerSize += retvalue;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_SEEK) { /* SEEKTABLE */
    size_t l = bigEndian(data, 3);
    m_controlCounter = FLAC_MBH;
    retvalue = l + 3;
    headerSize += retvalue;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_VORBIS) { /* VORBIS COMMENT */                         // field names
    const char fn[7][12] = {"TITLE", "VERSION", "ALBUM", "TRACKNUMBER", "ARTIST", "PERFORMER", "GENRE"};
    int offset;
    size_t l = bigEndian(data, 3);

    for (int i = 0; i < 7; i++) {
      offset = specialIndexOf(data, fn[i], len);
      if (offset >= 0) {
        sprintf(chbuf, "%s: %s", fn[i], data + offset + strlen(fn[i]) + 1);
        chbuf[strlen(chbuf) - 1] = 0;
        if (audio_id3data) audio_id3data(chbuf);
      }
    }
    m_controlCounter = FLAC_MBH;
    retvalue = l + 3;
    headerSize += retvalue;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_CUESHEET) { /* CUESHEET */
    size_t l = bigEndian(data, 3);
    m_controlCounter = FLAC_MBH;
    retvalue = l + 3;
    headerSize += retvalue;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == FLAC_PICTURE) { /* PICTURE */
    size_t l = bigEndian(data, 3);
    m_controlCounter = FLAC_MBH;
    retvalue = l + 3;
    headerSize += retvalue;
    return 0;
  }
  return 0;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::read_MP3_Header(uint8_t *data, size_t len) {

