Loucotolo/ESP32-audioI2S/src/Audio.cpp
    return 3 + 3 + len;
  }
  // -- end section V2.2 -----------

  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == 98) { // skip all ID3 metadata (mostly spaces)
    if (headerSize > 256) {
      headerSize -= 256;
      return 256;
    } // Throw it away
    else           {
      m_controlCounter = 99;
      return headerSize;
    } // Throw it away
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == 99) { //  exist another ID3tag?
    m_audioDataStart += id3Size;
    vTaskDelay(30);
    if ((*(data + 0) == 'I') && (*(data + 1) == 'D') && (*(data + 2) == '3')) {
      m_controlCounter = 0;
      return 0;
    }
    else {
      m_controlCounter = 100; // ok
      m_audioDataSize = m_contentlength - m_audioDataStart;
      AUDIO_INFO(sprintf(chbuf, "Audio-Length: %u", m_audioDataSize);)

      return 0;
    }
  }
  return 0;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::read_M4A_Header(uint8_t *data, size_t len) {
  /*
         ftyp
           | - moov  -> trak -> ... -> mp4a contains raw block parameters
           |    L... -> ilst  contains artist, composer ....
         free (optional)
           |
         mdat contains the audio data                                                      */


  static size_t headerSize = 0;
  static size_t retvalue = 0;
  static size_t atomsize = 0;
  static size_t audioDataPos = 0;

  if (retvalue) {
    if (retvalue > len) { // if returnvalue > bufferfillsize
      if (len > InBuff.getMaxBlockSize()) len = InBuff.getMaxBlockSize();
      retvalue -= len; // and wait for more bufferdata
      return len;
    }
    else {
      size_t tmp = retvalue;
      retvalue = 0;
      return tmp;
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == M4A_BEGIN) { // init
    headerSize = 0;
    retvalue = 0;
    atomsize = 0;
    audioDataPos = 0;
    m_controlCounter = M4A_FTYP;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == M4A_FTYP) { /* check_m4a_file */
    atomsize = bigEndian(data, 4); // length of first atom
    if (specialIndexOf(data, "ftyp", 10) != 4) {
      log_e("atom 'type' not found in header");
      stopSong();
      return -1;
    }
    int m4a  = specialIndexOf(data, "M4A ", 20);
    int isom = specialIndexOf(data, "isom", 20);

    if ((m4a != 8) && (isom != 8)) {
      log_e("subtype 'MA4 ' or 'isom' expected, but found '%s '", (data + 8));
      stopSong();
      return -1;
    }

    m_controlCounter = M4A_CHK;
    retvalue = atomsize;
    headerSize = atomsize;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == M4A_CHK) { /* check  Tag */
    atomsize = bigEndian(data, 4); // length of this atom
    if (specialIndexOf(data, "moov", 10) == 4) {
      m_controlCounter = M4A_MOOV;
      return 0;
    }
    else if (specialIndexOf(data, "free", 10) == 4) {
      retvalue = atomsize;
      headerSize += atomsize;
      return 0;
    }
    else if (specialIndexOf(data, "mdat", 10) == 4) {
      m_controlCounter = M4A_MDAT;
      return 0;
    }
    else {
      char atomName[5];
      (void)atomName;
      atomName[0] = *data;
      atomName[1] = *(data + 1);
      atomName[2] = *(data + 2);
      atomName[3] = *(data + 3);
      atomName[4] = 0;

      log_i("atom %s found", atomName);

      retvalue = atomsize;
      headerSize += atomsize;
      return 0;
    }
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == M4A_MOOV) { // moov
    // we are looking for track and ilst
    if (specialIndexOf(data, "trak", len) > 0) {
      int offset = specialIndexOf(data, "trak", len);
      retvalue = offset;
      atomsize -= offset;
      headerSize += offset;
      m_controlCounter = M4A_TRAK;
      return 0;
    }
    if (specialIndexOf(data, "ilst", len) > 0) {
      int offset = specialIndexOf(data, "ilst", len);
      retvalue = offset;
      atomsize -= offset;
      headerSize += offset;
      m_controlCounter = M4A_ILST;
      return 0;

    }
    if (atomsize > len - 10) {
      atomsize -= (len - 10);
      headerSize += (len - 10);
      retvalue = (len - 10);
    }
    else {
      m_controlCounter = M4A_CHK;
      retvalue = atomsize;
      headerSize += atomsize;
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == M4A_TRAK) { // trak
    if (specialIndexOf(data, "esds", len) > 0) {
      int esds = specialIndexOf(data, "esds", len); // Packaging/Encapsulation And Setup Data
      uint8_t *pos = data + esds;
      uint8_t len_of_OD  = *(pos + 12); // length of this OD (which includes the next 2 tags)
      (void)len_of_OD;
      uint8_t len_of_ESD = *(pos + 20); // length of this Elementary Stream Descriptor
      (void)len_of_ESD;
      uint8_t audioType  = *(pos + 21);
      if (audio_info) {
        if     (audioType == 0x40) sprintf(chbuf, "AudioType: MPEG4 / Audio"); // ObjectTypeIndication
        else if (audioType == 0x66) sprintf(chbuf, "AudioType: MPEG2 / Audio");
        else if (audioType == 0x69) sprintf(chbuf, "AudioType: MPEG2 / Audio Part 3"); // Backward Compatible Audio
        else if (audioType == 0x6B) sprintf(chbuf, "AudioType: MPEG1 / Audio");
        else                       sprintf(chbuf, "unknown Audio Type %x", audioType);
        audio_info(chbuf);
      }
      uint8_t streamType = *(pos + 22);
      streamType = streamType >> 2;  // 6 bits
      if (streamType != 5) {
        log_e("Streamtype is not audio!");
      }

      uint32_t maxBr = bigEndian(pos + 26, 4); // max bitrate
      AUDIO_INFO(sprintf(chbuf, "max bitrate: %i", maxBr);)

      uint32_t avrBr = bigEndian(pos + 30, 4); // avg bitrate
      AUDIO_INFO(sprintf(chbuf, "avr bitrate: %i", avrBr);)

      uint16_t ASC   = bigEndian(pos + 39, 2);

      uint8_t objectType = ASC >> 11; // first 5 bits
      if (audio_info) {
        if     (objectType == 1) sprintf(chbuf, "AudioObjectType: AAC Main"); // Audio Object Types
        else if (objectType == 2) sprintf(chbuf, "AudioObjectType: AAC Low Complexity");
        else if (objectType == 3) sprintf(chbuf, "AudioObjectType: AAC Scalable Sample Rate");
        else if (objectType == 4) sprintf(chbuf, "AudioObjectType: AAC Long Term Prediction");
        else if (objectType == 5) sprintf(chbuf, "AudioObjectType: AAC Spectral Band Replication");
        else if (objectType == 6) sprintf(chbuf, "AudioObjectType: AAC Scalable");
        else                     sprintf(chbuf, "unknown Audio Type %x", audioType);
        audio_info(chbuf);
      }

      const uint32_t samplingFrequencies[13] = {
        96000, 88200, 64000, 48000, 44100, 32000, 24000, 22050, 16000, 12000, 11025, 8000, 7350
      };
      uint8_t sRate = (ASC & 0x0600) >> 7; // next 4 bits Sampling Frequencies
      AUDIO_INFO(sprintf(chbuf, "Sampling Frequency: %u", samplingFrequencies[sRate]);)

