Loucotolo/ESP32-audioI2S/src/Audio.cpp
      uint8_t chConfig = (ASC & 0x78) >> 3;  // next 4 bits
      if (chConfig == 0) if (audio_info) audio_info("Channel Configurations: AOT Specifc Config");
      if (chConfig == 1) if (audio_info) audio_info("Channel Configurations: front-center");
      if (chConfig == 2) if (audio_info) audio_info("Channel Configurations: front-left, front-right");
      if (chConfig >  2) {
        log_e("Channel Configurations with more than 2 channels is not allowed!");
      }

      uint8_t frameLengthFlag     = (ASC & 0x04);
      uint8_t dependsOnCoreCoder  = (ASC & 0x02);
      (void)dependsOnCoreCoder;
      uint8_t extensionFlag       = (ASC & 0x01);
      (void)extensionFlag;

      if (frameLengthFlag == 0) if (audio_info) audio_info("AAC FrameLength: 1024 bytes");
      if (frameLengthFlag == 1) if (audio_info) audio_info("AAC FrameLength: 960 bytes");
    }
    if (specialIndexOf(data, "mp4a", len) > 0) {
      int offset = specialIndexOf(data, "mp4a", len);
      int channel = bigEndian(data + offset + 20, 2); // audio parameter must be set before starting
      int bps     = bigEndian(data + offset + 22, 2); // the aac decoder. There are RAW blocks only in m4a
      int srate   = bigEndian(data + offset + 26, 4); //
      setBitsPerSample(bps);
      setChannels(channel);
      setSampleRate(srate);
      setBitrate(bps * channel * srate);
      AUDIO_INFO(sprintf(chbuf, "ch; %i, bps: %i, sr: %i", channel, bps, srate);)

    }
    m_controlCounter = M4A_MOOV;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == M4A_ILST) { // ilst
    const char info[12][6] = { "nam\0", "ART\0", "alb\0", "too\0",  "cmt\0",  "wrt\0",
                               "tmpo\0", "trkn\0", "day\0", "cpil\0", "aART\0", "gen\0"
                             };
    int offset;
    for (int i = 0; i < 12; i++) {
      offset = specialIndexOf(data, info[i], len, true);  // seek info[] with '\0'
      if (offset > 0) {
        offset += 19; if (*(data + offset) == 0) offset ++;
        char value[256];
        size_t tmp = strlen((const char*)data + offset);
        if (tmp > 254) tmp = 254;
        memcpy(value, (data + offset), tmp);
        value[tmp] = 0;
        chbuf[0] = 0;
        if (i == 0)  sprintf(chbuf, "Title: %s", value);
        if (i == 1)  sprintf(chbuf, "Artist: %s", value);
        if (i == 2)  sprintf(chbuf, "Album: %s", value);
        if (i == 3)  sprintf(chbuf, "Encoder: %s", value);
        if (i == 4)  sprintf(chbuf, "Comment: %s", value);
        if (i == 5)  sprintf(chbuf, "Composer: %s", value);
        if (i == 6)  sprintf(chbuf, "BPM: %s", value);
        if (i == 7)  sprintf(chbuf, "Track Number: %s", value);
        if (i == 8)  sprintf(chbuf, "Year: %s", value);
        if (i == 9)  sprintf(chbuf, "Compile: %s", value);
        if (i == 10) sprintf(chbuf, "Album Artist: %s", value);
        if (i == 11) sprintf(chbuf, "Types of: %s", value);
        if (chbuf[0] != 0) {
          if (audio_id3data) audio_id3data(chbuf);
        }
      }
    }
    m_controlCounter = M4A_MOOV;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == M4A_MDAT) { // mdat
    m_audioDataSize = bigEndian(data, 4); // length of this atom
    AUDIO_INFO(sprintf(chbuf, "Audio-Length: %u", m_audioDataSize);)
    retvalue = 8;
    headerSize += 8;
    m_controlCounter = M4A_AMRDY;  // last step before starting the audio
    return 0;
  }

  if (m_controlCounter == M4A_AMRDY) { // almost ready
    m_audioDataStart = headerSize;
    m_contentlength = headerSize + m_audioDataSize; // after this mdat atom there may be other atoms

    m_controlCounter = M4A_OKAY; // that's all
    return 0;
  }
  // this section should never be reached
  log_e("error");
  return 0;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::read_OGG_Header(uint8_t *data, size_t len) {
  static size_t retvalue = 0;
  static size_t pageLen = 0;
  static bool   f_firstPacket = false;

  if (retvalue) {
    if (retvalue > len) { // if returnvalue > bufferfillsize
      if (len > InBuff.getMaxBlockSize()) len = InBuff.getMaxBlockSize();
      retvalue -= len; // and wait for more bufferdata
      return len;
    }
    else {
      size_t tmp = retvalue;
      retvalue = 0;
      return tmp;
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == OGG_BEGIN) { // init
    retvalue = 0;
    m_audioDataStart = 0;
    f_firstPacket = true;
    m_controlCounter = OGG_MAGIC;

    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == OGG_MAGIC) { /* check MAGIC STRING */
    if (specialIndexOf(data, "OggS", 10) != 0) {
      log_e("Magic String 'OggS' not found in header");
      stopSong();
      return -1;
    }
    m_controlCounter = OGG_HEADER;
    retvalue = 4;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == OGG_HEADER) { /* check OGG PAGE HEADER */
    uint8_t i = 0;
    uint8_t ssv = *(data + i);                  // stream_structure_version
    (void)ssv;
    i++;
    uint8_t htf = *(data + i);                  // header_type_flag
    (void)htf;
    i++;
    uint32_t tmp = bigEndian(data + i, 4);      // absolute granule position
    uint64_t agp = (uint64_t) tmp << 32;
    i += 4;
    agp += bigEndian(data + i, 4);
    i += 4;
    uint32_t ssnr = bigEndian(data + i, 4);     // stream serial number
    (void)ssnr;
    i += 4;
    uint32_t psnr = bigEndian(data + i, 4);     // page sequence no
    (void)psnr;
    i += 4;
    uint32_t pchk = bigEndian(data + i, 4);     // page checksum
    (void)pchk;
    i += 4;
    uint8_t psegm = *(data + i);
    i++;
    uint8_t psegmBuff[256];
    pageLen = 0;
    for (uint8_t j = 0; j < psegm; j++) {
      psegmBuff[j] = *(data + i);
      pageLen += psegmBuff[j];
      i++;
    }
    retvalue = i;
    if (agp == 0) {
      if (f_firstPacket == true) {
        f_firstPacket = false;
        m_controlCounter = OGG_FIRST; // ogg first pages
      }
      else {
        retvalue += pageLen;
        m_controlCounter = OGG_MAGIC;
      }
    }
    else {
      if (m_codec == CODEC_OGG_FLAC) {
        m_controlCounter = OGG_AMRDY;
      }
      else {
        if (audio_info) audio_info("unknown format");
        stopSong();
        return -1;
      }
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter == OGG_FIRST) { /* check OGG FIRST PAGES (has no streaming content) */
    uint8_t i = 0;
    uint8_t obp = *(data + i);                  // oneBytePacket shold be 0x7F
    (void)obp;
    i++;
    if (specialIndexOf(data + i, "FLAC", 10) == 0) {
    }
    else {
      log_i("ogg/flac support only"); // ogg/vorbis or ogg//opus not supported yet
      stopSong();
      return -1;
    }
    i += 4;
    uint8_t major_vers = *(data + i);
    (void)major_vers;
    i++;
    uint8_t minor_vers = *(data + i);
    (void)minor_vers;
    i++;
    uint16_t nonah = bigEndian(data + i, 2); // number of non audio headers (0x00 = unknown)
    (void)nonah;
    i += 2;
    if (specialIndexOf(data + i, "fLaC", 10) == 0) {
      m_codec = CODEC_OGG_FLAC;
    }
    i += 4;
    // STREAMINFO metadata block begins
    uint32_t mblen = bigEndian(data + i, 4);
    (void)mblen;
    i += 4; // skip metadata block header + length
    i += 2; // skip minimun block size
    m_flacMaxBlockSize = bigEndian(data + i, 2);
    i += 2;
    vTaskDelay(2);
    AUDIO_INFO(sprintf(chbuf, "FLAC maxBlockSize: %u", m_flacMaxBlockSize);)
    i += 3; // skip minimun frame size
    vTaskDelay(2);
    m_flacMaxFrameSize = bigEndian(data + i, 3);
    i += 3;
    if (m_flacMaxFrameSize) {
      AUDIO_INFO(sprintf(chbuf, "FLAC maxFrameSize: %u", m_flacMaxFrameSize);)
    }
    else {
      if (audio_info) audio_info("FLAC maxFrameSize: N/A");
    }
    if (m_flacMaxFrameSize > InBuff.getMaxBlockSize()) {
      log_e("FLAC maxFrameSize too large!");
      stopSong();
      return -1;
    }
    vTaskDelay(2);
    uint32_t nextval = bigEndian(data + i, 3);
    i += 3;
    m_flacSampleRate = nextval >> 4;
    AUDIO_INFO(sprintf(chbuf, "FLAC sampleRate: %u", m_flacSampleRate);)
    vTaskDelay(2);
    m_flacNumChannels = ((nextval & 0x06) >> 1) + 1;
    AUDIO_INFO(sprintf(chbuf, "FLAC numChannels: %u", m_flacNumChannels);)
    if (m_flacNumChannels != 1 && m_flacNumChannels != 2) {
      vTaskDelay(2);
      if (audio_info) audio_info("numChannels must be 1 or 2");
      stopSong();
      return -1;
    }
    vTaskDelay(2);
    uint8_t bps = (nextval & 0x01) << 4;
    bps += (*(data + i) >> 4) + 1;
    i++;
    m_flacBitsPerSample = bps;
    if ((bps != 8) && (bps != 16)) {
      log_e("bits per sample must be 8 or 16, is %i", bps);
      stopSong();
      return -1;
    }
    AUDIO_INFO(sprintf(chbuf, "FLAC bitsPerSample: %u", m_flacBitsPerSample);)
    m_flacTotalSamplesInStream = bigEndian(data + i, 4);
    i++;
    if (m_flacTotalSamplesInStream) {
      AUDIO_INFO(sprintf(chbuf, "total samples in stream: %u", m_flacTotalSamplesInStream);)
    }
    else {
      if (audio_info) audio_info("total samples in stream: N/A");
    }
    if (bps != 0 && m_flacTotalSamplesInStream) {
      AUDIO_INFO(sprintf(chbuf, "audio file duration: %u seconds", m_flacTotalSamplesInStream / m_flacSampleRate);)
    }
    m_controlCounter = OGG_MAGIC;
    retvalue = pageLen;
    return 0;
  }
  if (m_controlCounter == OGG_AMRDY) { // ogg almost ready
    if (!psramFound()) {
      if (audio_info) audio_info("FLAC works only with PSRAM!");
      m_f_running = false; stopSong();
      return -1;
    }
    if (!FLACDecoder_AllocateBuffers()) {
      m_f_running = false;
      stopSong();
      return -1;
    }
    InBuff.changeMaxBlockSize(m_frameSizeFLAC);
    AUDIO_INFO(sprintf(chbuf, "FLACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)

    m_controlCounter = OGG_OKAY; // 100
    retvalue = 0;
    return 0;
  }
  return 0;
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::stopSong() {
  uint32_t pos = 0;
  if (m_f_running) {
    m_f_running = false;

