Loucotolo/ESP32-audioI2S/src/Audio.cpp
  }
  if (getBitsPerSample() > 8) memset(m_outBuff,   0, sizeof(m_outBuff));    //Clear OutputBuffer (signed)
  else                       memset(m_outBuff, 128, sizeof(m_outBuff));     //Clear OutputBuffer (unsigned, PCM 8u)
  i2s_zero_dma_buffer((i2s_port_t) m_i2s_num);
  return pos;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::playI2Sremains() { // returns true if all dma_buffs flushed
  if (!getSampleRate()) setSampleRate(96000);
  if (!getChannels()) setChannels(2);
  if (getBitsPerSample() > 8) memset(m_outBuff,   0, sizeof(m_outBuff));    //Clear OutputBuffer (signed)
  else                       memset(m_outBuff, 128, sizeof(m_outBuff));     //Clear OutputBuffer (unsigned, PCM 8u)

  m_validSamples = m_i2s_config.dma_buf_len;
  while (m_validSamples) {
    playChunk();
  }
  return;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::pauseResume() {
  bool retVal = false;

  m_f_running = !m_f_running;
  retVal = true;
  if (!m_f_running) {
    memset(m_outBuff, 0, sizeof(m_outBuff));               //Clear OutputBuffer
    i2s_zero_dma_buffer((i2s_port_t) m_i2s_num);
  }

  return retVal;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::playChunk() {
  // If we've got data, try and pump it out..
  int16_t sample[2];
  if (getBitsPerSample() == 8) {
    if (getChannels() == 1) {
      while (m_validSamples) {
        uint8_t x =  m_outBuff[m_curSample] & 0x00FF;
        uint8_t y = (m_outBuff[m_curSample] & 0xFF00) >> 8;
        sample[LEFTCHANNEL]  = x;
        sample[RIGHTCHANNEL] = x;
        while (1) {
          if (playSample(sample)) break;
        } // Can't send?
        sample[LEFTCHANNEL]  = y;
        sample[RIGHTCHANNEL] = y;
        while (1) {
          if (playSample(sample)) break;
        } // Can't send?
        m_validSamples--;
        m_curSample++;
      }
    }
    if (getChannels() == 2) {
      while (m_validSamples) {
        uint8_t x =  m_outBuff[m_curSample] & 0x00FF;
        uint8_t y = (m_outBuff[m_curSample] & 0xFF00) >> 8;
        if (!m_f_forceMono) { // stereo mode
          sample[LEFTCHANNEL]  = x;
          sample[RIGHTCHANNEL] = y;
        }
        else { // force mono
          uint8_t xy = (x + y) / 2;
          sample[LEFTCHANNEL]  = xy;
          sample[RIGHTCHANNEL] = xy;
        }

        while (1) {
          if (playSample(sample)) break;
        } // Can't send?
        m_validSamples--;
        m_curSample++;
      }
    }
    m_curSample = 0;
    return true;
  }
  if (getBitsPerSample() == 16) {
    if (getChannels() == 1) {
      while (m_validSamples) {
        sample[LEFTCHANNEL]  = m_outBuff[m_curSample];
        sample[RIGHTCHANNEL] = m_outBuff[m_curSample];
        if (!playSample(sample)) {
          return false;
        } // Can't send
        m_validSamples--;
        m_curSample++;
      }
    }
    if (getChannels() == 2) {
      while (m_validSamples) {
        if (!m_f_forceMono) { // stereo mode
          sample[LEFTCHANNEL]  = m_outBuff[m_curSample * 2];
          sample[RIGHTCHANNEL] = m_outBuff[m_curSample * 2 + 1];
        }
        else { // mono mode, #100
          int16_t xy = (m_outBuff[m_curSample * 2] + m_outBuff[m_curSample * 2 + 1]) / 2;
          sample[LEFTCHANNEL] = xy;
          sample[RIGHTCHANNEL] = xy;
        }
        if (!playSample(sample)) {
          return false;
        } // Can't send
        m_validSamples--;
        m_curSample++;
      }
    }
    m_curSample = 0;
    return true;
  }
  log_e("BitsPer Sample must be 8 or 16!");
  return false;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::loop() {

  // - webstream - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (!m_f_running) return;

  //        if(m_f_m3u8wait){                                    // timer, wait for fresh m3u8 playlist
  //            if(m_t1 < millis()){
  //                log_i("wait zurückgesetzt");
  //                m_f_m3u8wait = false;
  //                processPlayListData();
  //            }
  //        }
  if (m_datamode == AUDIO_PLAYLISTINIT || m_datamode == AUDIO_PLAYLISTHEADER || m_datamode == AUDIO_PLAYLISTDATA) {
    processPlayListData();
    if (m_f_m3u8data) processWebStream();
    return;
  }
  if (m_datamode == AUDIO_HEADER) {
    processAudioHeaderData();
    if (m_f_m3u8data) processWebStream();
    return;
  }
  if (m_datamode == AUDIO_DATA) {
    processWebStream();
    return;
  }

  return;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::processPlayListData() {

  static bool f_entry     = false;                            // entryflag for asx playlist
  static bool f_title     = false;                            // titleflag for asx playlist
  static bool f_ref       = false;                            // refflag   for asx playlist
  static bool f_begin     = false;
  static bool f_end       = false;
  static bool f_ct        = false;

  (void)f_title;  // is unused yet

  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_datamode == AUDIO_PLAYLISTINIT) {                 // Initialize for receive .m3u file
    // We are going to use metadata to read the lines from the .m3u file
    // Sometimes this will only contain a single line
    f_entry     = false;
    f_title     = false;
    f_ref       = false;
    f_begin     = false;
    f_end       = false;
    f_ct        = false;

    m_datamode = AUDIO_PLAYLISTHEADER;                  // Handle playlist data
    //if(audio_info) audio_info("Read from playlist");
  } // end AUDIO_PLAYLISTINIT

  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  int av = 0;
  av = _client->available();

