Loucotolo/ESP32-audioI2S/src/Audio.cpp
  if (av < 1) {
    if (f_end) return;
    if (f_begin) {
      f_end = true;
    }
    else return;
  }

  char pl[256]; // playlistline
  uint8_t b = 0;
  int16_t pos = 0;

  while (true) {
    b = _client->read();


    if (b == 0xff) b = '\n'; // no more to read? send new line
    if (b == '\n') {
      pl[pos] = 0;
      break;
    }
    if (b < 0x20 || b > 0x7E) continue;
    pl[pos] = b;
    if (pos < 255) pos++;
    if (pos == 254) {
      pl[pos] = '\0'; /*log_e("playlistline overflow");*/
    }
  }

  if (strlen(pl) == 0 && m_datamode == AUDIO_PLAYLISTHEADER) {
    if (m_f_Log) if (audio_info) audio_info("Switch to PLAYLISTDATA");
    m_datamode = AUDIO_PLAYLISTDATA;                    // Expecting data now
    return;
  }

  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_datamode == AUDIO_PLAYLISTHEADER) {                   // Read header

    if (m_f_Log) {
      AUDIO_INFO(sprintf(chbuf, "Playlistheader: %s", pl);)
    } // Show playlistheader

    if (indexOf(pl, "Content-Type:", 0)) {
      f_ct = true;                                        // found ContentType in pl
    }

    if (indexOf(pl, "content-type:", 0)) {
      f_ct = true;                                        // found ContentType in pl
    }

    if ((indexOf(pl, "Connection:close", 0) >= 0) && !f_ct) { // #193 is not a playlist if no ct found
      m_datamode = AUDIO_HEADER;
    }

    int pos = indexOf(pl, "400 Bad Request", 0);
    if (pos >= 0) {
      m_datamode = AUDIO_NONE;
      if (audio_fail_stream) audio_fail_stream("Error 400 Bad Request");
      stopSong();
      return;
    }

    pos = indexOf(pl, "404 Not Found", 0);
    if (pos >= 0) {
      m_datamode = AUDIO_NONE;
      if (audio_fail_stream) audio_fail_stream("Error 404 Not Found");
      stopSong();
      return;
    }

    pos = indexOf(pl, "404 File Not Found", 0);
    if (pos >= 0) {
      m_datamode = AUDIO_NONE;
      if (audio_fail_stream) audio_fail_stream("Error 404 File Not Found");
      stopSong();
      return;
    }

    pos = indexOf(pl, "HTTP/1.0 404", 0);
    if (pos >= 0) {
      m_datamode = AUDIO_NONE;
      if (audio_fail_stream)  audio_fail_stream("Error 404 Not Available");
      stopSong();
      return;
    }

    pos = indexOf(pl, "HTTP/1.1 401", 0);
    if (pos >= 0) {
      m_datamode = AUDIO_NONE;

      if (audio_fail_stream)  audio_fail_stream("Error 401 Unauthorized");
      stopSong();
      return;
    }

    pos = indexOf(pl, "HTTP/1.1 403", 0);
    if (pos >= 0) {
      m_datamode = AUDIO_NONE;

      if (audio_fail_stream)  audio_fail_stream("Error 403 Forbidden");
      stopSong();
      return;
    }

    pos = indexOf(pl, ":", 0);                          // lowercase all letters up to the colon
    if (pos >= 0) {
      for (int i = 0; i < pos; i++) {
        pl[i] = toLowerCase(pl[i]);
      }
    }

    if (startsWith(pl, "icy-")) {                       // icy-data in playlist? that can not be
      m_datamode = AUDIO_HEADER;
      if (audio_fail_stream)  audio_fail_stream("playlist is not valid, switch to AUDIO_HEADER");

      return;
    }


    if (startsWith(pl, "location:") || startsWith(pl, "Location:")) {
      char* host;
      pos = indexOf(pl, "http", 0);
      host = (pl + pos);
      //            sprintf(chbuf, "redirect to new host %s", host);
      //            if(m_f_Log) if(audio_info) audio_info(chbuf);
      pos = indexOf(pl, "/", 10);
      if (strncmp(host, m_lastHost, pos) == 0) {                                  // same host?
        _client->stop(); _client->flush();
        httpPrint(host);
      }
      else connecttohost(host);                                                   // different host,
    }
    return;
  } // end AUDIO_PLAYLISTHEADER

  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_datamode == AUDIO_PLAYLISTDATA) {                 // Read next byte of .m3u file data
    if (m_f_Log) {
      AUDIO_INFO(sprintf(chbuf, "Playlistdata: %s", pl);)
    }   // Show playlistdata


    if (m_f_Log) {
      AUDIO_INFO(sprintf(chbuf, "PlaylistFormat: %i", m_playlistFormat);)
    }   // Show playlistdata

    pos = indexOf(pl, "<!DOCTYPE", 0);                  // webpage found
    if (pos >= 0) {
      m_datamode = AUDIO_NONE;
      if (audio_fail_stream)  audio_fail_stream("Not Found");
      stopSong();
      return;
    }

    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_playlistFormat == FORMAT_M3U) {

      if (!f_begin) f_begin = true;                   // first playlistdata received
      if (indexOf(pl, "#EXTINF:", 0) >= 0) {          // Info?
        pos = indexOf(pl, ",", 0);                   // Comma in this line?
        if (pos > 0) {
          // Show artist and title if present in metadata
          if (audio_info) audio_info(pl + pos + 1);
        }
        return;
      }
      if (startsWith(pl, "#")) {                       // Commentline?
        return;
      }

      pos = indexOf(pl, "http://:@", 0); // ":@"??  remove that!
      if (pos >= 0) {
        AUDIO_INFO(sprintf(chbuf, "Entry in playlist found: %s", (pl + pos + 9));)
        connecttohost(pl + pos + 9);
        return;
      }
      //sprintf(chbuf, "Entry in playlist found: %s", pl);
      //if(audio_info) audio_info(chbuf);
      pos = indexOf(pl, "http", 0);                    // Search for "http"
      const char* host;
      if (pos >= 0) {                                  // Does URL contain "http://"?
        host = (pl + pos);
        connecttohost(host);
      }                                                // Yes, set new host
      return;
    } //m3u

    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_playlistFormat == FORMAT_PLS) {

      if (!f_begin) {
        if (strlen(pl) == 0) return;                // empty line
        if (strcmp(pl, "[playlist]") == 0) {        // first entry in valid pls
          f_begin = true;                         // we have first playlistdata received
          return;
        }
        else {
          m_datamode = AUDIO_HEADER;                // pls is not valid
          if (audio_fail_stream)  audio_fail_stream("pls is not valid, switch to AUDIO_HEADER");
          return;
        }
      }

      if (startsWith(pl, "File1")) {
        pos = indexOf(pl, "http", 0);                   // File1=http://streamplus30.leonex.de:14840/;
        if (pos >= 0) {                                 // yes, URL contains "http"?
          memcpy(m_lastHost, pl + pos, strlen(pl) + 1);   // http://streamplus30.leonex.de:14840/;
          // Now we have an URL for a stream in host.
          f_ref = true;
        }
      }
      if (startsWith(pl, "Title1")) {                     // Title1=Antenne Tirol
        const char* plsStationName = (pl + 7);
        if (audio_showstation) audio_showstation(plsStationName);
        AUDIO_INFO(sprintf(chbuf, "StationName: \"%s\"", plsStationName);)
        f_title = true;
      }
      if (startsWith(pl, "Length1")) f_title = true;              // if no Title is available
      if ((f_ref == true) && (strlen(pl) == 0)) f_title = true;

      if (indexOf(pl, "Invalid username", 0) >= 0) { // Unable to access account: Invalid username or password
        m_f_running = false;
        stopSong();
        m_datamode = AUDIO_NONE;
        return;
      }

      if (f_end) {                                     // we have both StationName and StationURL
        log_d("connect to new host %s", m_lastHost);
        connecttohost(m_lastHost);                              // Connect to it
      }
      return;
    } // pls

    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_playlistFormat == FORMAT_ASX) { // Advanced Stream Redirector
      if (!f_begin) f_begin = true;                       // first playlistdata received
      int p1 = indexOf(pl, "<", 0);
      int p2 = indexOf(pl, ">", 1);
      if (p1 >= 0 && p2 > p1) {                               // #196 set all between "< ...> to lowercase
        for (uint8_t i = p1; i < p2; i++) {
          pl[i] = toLowerCase(pl[i]);
        }
      }

      if (indexOf(pl, "<entry>", 0) >= 0) f_entry = true;     // found entry tag (returns -1 if not found)
      if (indexOf(pl, "<Entry>", 0) >= 0) f_entry = true;     // found entry tag (returns -1 if not found)
      if (indexOf(pl, "<entry clientskip=\"yes\">", 0) >= 0) f_entry = true;     // found entry tag (returns -1 if not found)
      if (indexOf(pl, "<entry ClientSkip =\"yes\">", 0) >= 0) f_entry = true;     // found entry tag (returns -1 if not found)
      if (indexOf(pl, "<entry clientskip = \"no\">", 0) >= 0) f_entry = true;     // found entry tag (returns -1 if not found)
      if (f_entry) {
        if (indexOf(pl, "ref href", 0) > 0) {               // <ref href="http://87.98.217.63:24112/stream" />
          pos = indexOf(pl, "http", 0);
          if (pos > 0) {
            char* plsURL = (pl + pos);                  // http://87.98.217.63:24112/stream" />
            int pos1 = indexOf(plsURL, "\"", 0);        // http://87.98.217.63:24112/stream
            if (pos1 > 0) {
              plsURL[pos1] = '\0';
            }
            memcpy(m_lastHost, plsURL, strlen(plsURL) + 1); // save url in array
            log_d("m_lastHost = %s", m_lastHost);
            // Now we have an URL for a stream in host.
            f_ref = true;
          }
        }
        pos = indexOf(pl, "<title>", 0);
        if (pos < 0) pos = indexOf(pl, "<Title>", 0);
        if (pos >= 0) {
          char* plsStationName = (pl + pos + 7);          // remove <Title>
          pos = indexOf(plsStationName, "</", 0);
          if (pos >= 0) {
            *(plsStationName + pos) = 0;            // remove </Title>
          }
          if (audio_showstation) audio_showstation(plsStationName);
          AUDIO_INFO(sprintf(chbuf, "StationName: \"%s\"", plsStationName);)
          f_title = true;
        }
      } //entry
      if (indexOf(pl, "http", 0) == 0 && !f_entry) { //url only in asx
        memcpy(m_lastHost, pl, strlen(pl)); // save url in array
        m_lastHost[strlen(pl)] = '\0';
        log_d("m_lastHost = %s", m_lastHost);
        connecttohost(pl);
      }
      if (f_end) {  //we have both StationName and StationURL
        connecttohost(m_lastHost);                          // Connect to it
      }
      return;
    }  //asx
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_playlistFormat == FORMAT_M3U8) {



      static bool f_StreamInf = false;                            // set if  #EXT-X-STREAM-INF in m3u8
      static bool f_ExtInf    = false;                            // set if  #EXTINF in m3u8
      static uint8_t plsEntry = 0;                                // used in m3u8, counts url entries
      static uint8_t seqNrPos = 0;                                // position at which the SeqNr is found

      if (!f_begin) {
        if (strlen(pl) == 0) return;                            // empty line
        if (strcmp(pl, "#EXTM3U") == 0) {                       // what we expected
          f_begin      = true;
          f_StreamInf  = false;
          f_ExtInf     = false;
          plsEntry     = 0;
          return;
        }
        else {
          m_datamode = AUDIO_HEADER;                          // m3u8 is not valid
          m_playlistFormat = FORMAT_NONE;
          if (audio_fail_stream)  audio_fail_stream("m3u8 is not valid, switch to AUDIO_HEADER");
          return;
        }
      }

      // example: redirection
      // #EXTM3U
      // #EXT-X-STREAM-INF:BANDWIDTH=22050,CODECS="mp4a.40.2"
      // http://ample.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/playlist.m3u8

      // example: audio chunks
      // #EXTM3U
      // #EXT-X-TARGETDURATION:10
      // #EXT-X-MEDIA-SEQUENCE:163374040
      // #EXT-X-DISCONTINUITY
      // #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
      // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374038.aac
      // #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
      // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374039.aac

      if (startsWith(pl, "#EXT-X-STREAM-INF:")) {
        int pos = indexOf(pl, "CODECS=\"mp4a", 18);
        if (pos < 0) { // not found
          m_m3u8codec  = CODEC_NONE;
          log_e("codec %s in m3u8 playlist not supportet", pl);
          sprintf(chbuf, "codec %s in m3u8 playlist not supportet", pl);
          if (audio_fail_stream)  audio_fail_stream(chbuf);
          stopSong();
          return;
        }
        f_StreamInf = true;
        m_m3u8codec = CODEC_M4A;
        return;
      }

