Loucotolo/ESP32-audioI2S/src/Audio.cpp
label1:

  httpPrint(entryaddr);

  if (currentSeqNr < maxSeqNr) {
    m_datamode = AUDIO_HEADER;
    m_f_continue = true;
    currentSeqNr++;
  }
  else {
    m_datamode = AUDIO_PLAYLISTINIT;
    m_playlistFormat = FORMAT_M3U8;
  }
  m_f_Log = false;
  return;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::STfromEXTINF(char* str) {
  // extraxt StreamTitle from m3u #EXTINF line to icy-format
  // orig: #EXTINF:10,title="text="TitleName",artist="ArtistName"
  // conv: StreamTitle=TitleName - ArtistName
  // orig: #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
  // conv: StreamTitle=text=\"Spot Block End\" amgTrackId=\"9876543\" -

  if (!startsWith(str, "#EXTINF")) return false;
  int t1, t2, t3, n0 = 0, n1 = 0, n2 = 0;

  t1 = indexOf(str, "title", 0);
  if (t1 > 0) {
    strcpy(chbuf, "StreamTitle="); n0 = 12;
    t2 = t1 + 7; // title="
    t3 = indexOf(str, "\"", t2);
    while (str[t3 - 1] == '\\') {
      t3 = indexOf(str, "\"", t3 + 1);
    }
    if (t2 < 0 || t2 > t3) return false;
    n1 = t3 - t2;
    strncpy(chbuf + n0, str + t2, n1);
  }

  t1 = indexOf(str, "artist", 0);
  if (t1 > 0) {
    strcpy(chbuf + n0 + n1, " - ");   n1 += 3;
    t2 = indexOf(str, "=\"", t1); t2 += 2;
    t3 = indexOf(str, "\"", t2);
    if (t2 < 0 || t2 > t3) return false;
    n2 = t3 - t2;
    strncpy(chbuf + n0 + n1, str + t2, n2);
    chbuf[n0 + n1 + n2] = '\0';
  }
  strcpy(str, chbuf);

  return true;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::processWebStream() {

  const uint16_t  maxFrameSize = InBuff.getMaxBlockSize();    // every mp3/aac frame is not bigger
  int32_t         availableBytes;                             // available bytes in stream
  static bool     f_tmr_1s;
  static bool     f_stream;                                   // first audio data received
  static int      bytesDecoded;
  static uint32_t byteCounter;                                // count received data
  static uint32_t chunksize;                                  // chunkcount read from stream
  static uint32_t tmr_1s;                                     // timer 1 sec
  static uint32_t loopCnt;                                    // count loops if clientbuffer is empty
  static uint32_t metacount;                                  // counts down bytes between metadata


  // first call, set some values to default - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_f_firstCall) { // runs only ont time per connection, prepare for start
    m_f_firstCall = false;
    f_stream = false;
    byteCounter = 0;
    chunksize = 0;
    bytesDecoded = 0;
    loopCnt = 0;
    tmr_1s = millis();
    m_t0 = millis();
    metacount = m_metaint;
    readMetadata(0, true); // reset all static vars
  }
  if (m_f_continue) { // next m3u8 chunk is available
    byteCounter = 0;
    metacount = m_metaint;
    m_f_continue = false;
  }

  // have we reached the end of the webfile?  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_f_webfile && byteCounter == m_contentlength) {
    if (InBuff.bufferFilled() < 10000) {
      if (m_datamode == AUDIO_DATA && m_f_m3u8data) {
        processM3U8entries();  // we need the next audioChunk
        return;
      }
    }
    if (InBuff.bufferFilled() > 0) {
      if (InBuff.bufferFilled() == 128) { // post tag? comes sometimes after podcasts
        if (indexOf((const char*)InBuff.getReadPtr(), "TAG", 0) == 0) {
          log_i("%s", InBuff.getReadPtr() + 3);
          InBuff.bytesWasRead(128);
          return;
        }
        else {
          log_v("%s", InBuff.getReadPtr());
          InBuff.bytesWasRead(InBuff.bufferFilled());
          return;
        }
      }
      bytesDecoded = sendBytes(InBuff.getReadPtr(), InBuff.bufferFilled());
      if (bytesDecoded > 0) {
        InBuff.bytesWasRead(bytesDecoded);
        return;
      }
      if (bytesDecoded == 0) return; // syncword at pos0 found
    }
    if (m_f_m3u8data) return;

    playI2Sremains();
    stopSong(); // Correct close when play known length sound #74 and before callback #112


    AUDIO_INFO(sprintf(chbuf, "End of webstream: \"%s\"", m_lastHost);)
    if (audio_eof_stream) audio_eof_stream(m_lastHost);

    return;
  }

  if (m_datamode != AUDIO_DATA) return;

  // timer, triggers every second - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if ((tmr_1s + 1000) < millis()) {
    f_tmr_1s = true;                                        // flag will be set every second for one loop only
    tmr_1s = millis();
  }

  availableBytes = _client->available();      // available from stream

  // if we have chunked data transfer: get the chunksize- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_f_chunked && !m_chunkcount && availableBytes) { // Expecting a new chunkcount?
    int b;
    b = _client->read();

    if (b == '\r') return;
    if (b == '\n') {
      m_chunkcount = chunksize;
      chunksize = 0;

      return;
    }
    // We have received a hexadecimal character.  Decode it and add to the result.
    b = toupper(b) - '0';                       // Be sure we have uppercase
    if (b > 9) b = b - 7;                       // Translate A..F to 10..15
    chunksize = (chunksize << 4) + b;
    return;
  }

  // if we have metadata: get them - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (!metacount && !m_f_swm && availableBytes) {
    int16_t b = 0;
    b = _client->read();


    if (b >= 0) {
      if (m_f_chunked) m_chunkcount--;
      if (readMetadata(b)) metacount = m_metaint;
    }
    return;
  }

  // if the buffer is often almost empty issue a warning  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (InBuff.bufferFilled() < maxFrameSize && f_stream) {
    static uint8_t cnt_slow = 0;
    cnt_slow ++;
    if (f_tmr_1s) {
      if (cnt_slow > 25 && audio_info) audio_info("slow stream, dropouts are possible");
      prebuffer = prebuffer + 50;
      if (prebuffer > 400) {
        prebuffer = 200;
      }
      f_tmr_1s = false;
      cnt_slow = 0;
      f_stream = false;
    }
  }

