Loucotolo/ESP32-audioI2S/src/Audio.cpp
  // if the buffer can't filled for several seconds try a new connection  - - - - - - - - - - - - - - - - - - - - - -
  if (f_stream && !availableBytes) {
    loopCnt++;
    if (loopCnt > 200000) {             // wait several seconds
      loopCnt = 0;
      if (audio_info) audio_info("Stream lost -> try new connection");
      //connecttohost(m_lastHost);
    }
  }
  if (availableBytes) loopCnt = 0;

  // buffer fill routine  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (true) { // statement has no effect
    uint32_t bytesCanBeWritten = InBuff.writeSpace();
    if (!m_f_swm)    bytesCanBeWritten = min(metacount,  bytesCanBeWritten);
    if (m_f_chunked) bytesCanBeWritten = min(m_chunkcount, bytesCanBeWritten);

    int16_t bytesAddedToBuffer = 0;

    if (InBuff.havePSRAM()) if (bytesCanBeWritten > 4096) bytesCanBeWritten = 4096; // PSRAM throttle

    if (m_f_webfile) {
      // normally there is nothing to do here, if byteCounter == contentLength
      // then the file is completely read, but:
      // m4a files can have more data  (e.g. pictures ..) after the audio Block
      // therefore it is bad to read anything else (this can generate noise)
      if (byteCounter + bytesCanBeWritten >= m_contentlength) bytesCanBeWritten = m_contentlength - byteCounter;
    }

    bytesAddedToBuffer = _client->read(InBuff.getWritePtr(), bytesCanBeWritten);

    if (bytesAddedToBuffer > 0) {
      if (m_f_webfile)             byteCounter  += bytesAddedToBuffer; // Pull request #42
      if (!m_f_swm)                metacount  -= bytesAddedToBuffer;
      if (m_f_chunked)             m_chunkcount -= bytesAddedToBuffer;
      InBuff.bytesWritten(bytesAddedToBuffer);
    }

    if (localmp3 == true) {
      if (!f_stream) {
        f_stream = true;  // ready to play the audio data
        if (audio_start_stream) audio_start_stream("stream ready");
      }
    } else {
      if (InBuff.bufferFilled() > (maxFrameSize * prebuffer) && !f_stream) { // waiting for buffer filled
        f_stream = true;  // ready to play the audio data
        uint16_t filltime = millis() - m_t0;
        if (audio_start_stream) audio_start_stream("stream ready");
        AUDIO_INFO(sprintf(chbuf, "buffer filled in %d ms", filltime);)
      } else {
        if (!f_stream) {
          if (audio_buffering_stream) audio_buffering_stream("Bufferring");
        }
      }
      if (!f_stream) return;

    }
  }

  // if we have a webfile, read the file header first - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_f_webfile && m_controlCounter != 100 && !m_f_m3u8data) { // m3u8call, audiochunk has no header
    if (InBuff.bufferFilled() < maxFrameSize) return;
    if (m_codec == CODEC_WAV) {
      int res = read_WAV_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
      if (res >= 0) bytesDecoded = res;
      else {
        stopSong();
        return;
      }
    }
    if (m_codec == CODEC_MP3) {
      int res = read_MP3_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
      if (res >= 0) bytesDecoded = res;
      else {
        m_controlCounter = 100; // error, skip header
      }
    }
    if (m_codec == CODEC_M4A) {
      int res = read_M4A_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
      if (res >= 0) bytesDecoded = res;
      else {
        stopSong();
        return;
      }
    }
    if (m_codec == CODEC_FLAC) {
      int res = read_FLAC_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
      if (res >= 0) bytesDecoded = res;
      else {
        stopSong();  // error, skip header
        return;
      }
    }
    if (m_codec == CODEC_AAC) { // aac has no header
      m_controlCounter = 100;
      return;
    }
    InBuff.bytesWasRead(bytesDecoded);
    return;
  }

  // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if ((InBuff.bufferFilled() >= maxFrameSize) && (f_stream == true)) { // fill > framesize?
    if (m_f_webfile) {
      bytesDecoded = sendBytes(InBuff.getReadPtr(), maxFrameSize);
    }
    else { // not a webfile
      if (m_controlCounter != 100 && (m_codec == CODEC_OGG || m_codec == CODEC_OGG_FLAC)) { //application/ogg
        int res = read_OGG_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
        if (res >= 0) bytesDecoded = res;
        else { // error, skip header
          stopSong();
          m_controlCounter = 100;
        }
      }
      else {
        bytesDecoded = sendBytes(InBuff.getReadPtr(), maxFrameSize);
      }
    }
    if (bytesDecoded < 0) { // no syncword found or decode error, try next chunk
      InBuff.bytesWasRead(200); // try next chunk

      return;
    }
    else {
      InBuff.bytesWasRead(bytesDecoded);
    }
  }
  return;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::processAudioHeaderData() {

  int av = 0;
  av = _client->available();
  if (av <= 0) return;

  char hl[512]; // headerline
  uint8_t b = 0;
  uint16_t pos = 0;
  int16_t idx = 0;

  static bool f_icyname = false;
  static bool f_icydescription = false;
  static bool f_icyurl = false;

  while (true) {
    b = _client->read();
    if (b == '\n') break;
    if (b == '\r') hl[pos] = 0;
    if (b < 0x20) continue;
    hl[pos] = b;
    pos++;
    if (pos == 510) {
      hl[pos] = '\0';
      log_e("headerline overflow");
      break;
    }
  }

  if (!pos && m_f_ctseen) { // audio header complete?
    m_datamode = AUDIO_DATA;                         // Expecting data now
    if (m_f_Log) {
      AUDIO_INFO(sprintf(chbuf, "Switch to DATA, metaint is %d", m_metaint);)
    }
    memcpy(chbuf, m_lastHost, strlen(m_lastHost) + 1);
    //        uint idx = indexOf(chbuf, "?", 0);
    //        if(idx > 0) chbuf[idx] = 0;
    if (audio_lasthost) audio_lasthost(chbuf);
    if (!f_icyname) {
      if (audio_showstation) audio_showstation("");
    }
    if (!f_icydescription) {
      if (audio_icydescription) audio_icydescription("");
    }
    if (!f_icyurl) {
      if (audio_icyurl) audio_icyurl("");
    }
    f_icyname = false;
    f_icydescription = false;
    f_icyurl = false;
    delay(50);  // #77
    return;
  }
  if (!pos) {
    stopSong();
    if (audio_showstation) audio_showstation("");
    if (audio_icydescription) audio_icydescription("");
    if (audio_icyurl) audio_icyurl("");
    f_icyname = false;
    f_icydescription = false;
    f_icyurl = false;
    log_e("can't see content in audioHeaderData");
    return;
  }

  idx = indexOf(hl, ":", 0); // lowercase all letters up to the colon
  if (idx >= 0) {
    for (int i = 0; i < idx; i++) {
      hl[i] = toLowerCase(hl[i]);
    }
  }

  if (indexOf(hl, "HTTP/1.0 404", 0) >= 0) {
    m_f_running = false;
    stopSong();
    if (audio_info) audio_info("404 Not Found");
    return;
  }

  if (indexOf(hl, "HTTP/1.1 404", 0) >= 0) {
    m_f_running = false;
    stopSong();
    if (audio_info) audio_info("404 Not Found");
    return;
  }

  if (indexOf(hl, "ICY 401", 0) >= 0) {
    m_f_running = false;
    stopSong();
    if (audio_info) audio_info("ICY 401 Service Unavailable");
    return;
  }

  if (indexOf(hl, "content-type:", 0) >= 0) {
    if (parseContentType(hl)) m_f_ctseen = true;
  }
  else if (startsWith(hl, "location:")) {
    int pos = indexOf(hl, "http", 0);
    const char* c_host = (hl + pos);
    AUDIO_INFO(sprintf(chbuf, "redirect to new host \"%s\"", c_host);)
    connecttohost(c_host);
  }
  else if (startsWith(hl, "content-disposition:")) {
    int pos1, pos2; // pos3;
    // e.g we have this headerline:  content-disposition: attachment; filename=stream.asx
    // filename is: "stream.asx"
    pos1 = indexOf(hl, "filename=", 0);
    if (pos1 > 0) {
      pos1 += 9;
      if (hl[pos1] == '\"') pos1++; // remove '\"' around filename if present
      pos2 = strlen(hl);
      if (hl[pos2 - 1] == '\"') hl[pos2 - 1] = '\0';
    }
    log_d("Filename is %s", hl + pos1);
  }
  else if (startsWith(hl, "set-cookie:")    ||
           startsWith(hl, "pragma:")        ||
           startsWith(hl, "expires:")       ||
           startsWith(hl, "cache-control:") ||
           startsWith(hl, "icy-pub:")       ||
           startsWith(hl, "p3p:")           ||
           startsWith(hl, "accept-ranges:") ) {
    ; // do nothing
  }
  else if (startsWith(hl, "connection:")) {
    if (indexOf(hl, "close", 0) >= 0) {
      ; /* do nothing */
    }
  }
  else if (startsWith(hl, "icy-genre:")) {
    ; // do nothing Ambient, Rock, etc
  }
  else if (startsWith(hl, "icy-br:")) {
    const char* c_bitRate = (hl + 7);
    int32_t br = atoi(c_bitRate); // Found bitrate tag, read the bitrate in Kbit
    br = br * 1000;
    setBitrate(br);
    sprintf(chbuf, "%d", getBitRate());
    if (audio_bitrate) audio_bitrate(chbuf);
  }
  else if (startsWith(hl, "icy-metaint:")) {
    const char* c_metaint = (hl + 12);
    int32_t i_metaint = atoi(c_metaint);
    m_metaint = i_metaint;
    if (m_metaint) m_f_swm = false     ;                           // Multimediastream
  }
  else if (startsWith(hl, "icy-name:")) {
    char* c_icyname = (hl + 9); // Get station name
    idx = 0;
    while (c_icyname[idx] == ' ') {
      idx++;
    } c_icyname += idx;        // Remove leading spaces
    idx = strlen(c_icyname);
    while (c_icyname[idx] == ' ') {
      idx--;
    } c_icyname[idx + 1] = 0;  // Remove trailing spaces

    if (strlen(c_icyname) > 0) {
      AUDIO_INFO(sprintf(chbuf, "icy-name: %s", c_icyname);)
      if (audio_showstation) audio_showstation(c_icyname);
      f_icyname = true;
    }
  }
  else if (startsWith(hl, "content-length:")) {
    const char* c_cl = (hl + 15);
    int32_t i_cl = atoi(c_cl);
    m_contentlength = i_cl;
    m_f_webfile = true; // Stream comes from a fileserver
    if (m_f_Log) {
      AUDIO_INFO(sprintf(chbuf, "content-length: %i", m_contentlength);)
    }
  }
  else if (startsWith(hl, "icy-description:")) {
    const char* c_idesc = (hl + 16);
    while (c_idesc[0] == ' ') c_idesc++;
    latinToUTF8(hl, sizeof(hl)); // if already UTF-0 do nothing, otherwise convert to UTF-8
    if (audio_icydescription) audio_icydescription(c_idesc);
    f_icydescription = true;
  }
  else if ((startsWith(hl, "transfer-encoding:"))) {
    if (endsWith(hl, "chunked") || endsWith(hl, "Chunked") ) { // Station provides chunked transfer
      m_f_chunked = true;
      if (audio_info) audio_info("chunked data transfer");
      m_chunkcount = 0;                         // Expect chunkcount in DATA
    }
  }
  else if (startsWith(hl, "icy-url:")) {
    const char* icyurl = (hl + 8);
    idx = 0;
    while (icyurl[idx] == ' ') {
      idx ++;
    } icyurl += idx; // remove leading blanks
    //sprintf(chbuf, "icy-url: %s", icyurl);
    // if(audio_info) audio_info(chbuf);
    if (audio_icyurl) audio_icyurl(icyurl);
    f_icyurl = true;
  }
  else if (startsWith(hl, "www-authenticate:")) {
    if (audio_info) audio_info("authentification failed, wrong credentials?");
    m_f_running = false;
    stopSong();
  }
  else {
    if (isascii(hl[0]) && hl[0] >= 0x20) { // all other
      if (m_f_Log) {
        AUDIO_INFO(sprintf(chbuf, "%s", hl);)
      }
    }
  }
  return;
}

