Loucotolo/ESP32-audioI2S/src/Audio.cpp
//---------------------------------------------------------------------------------------------------------------------
bool Audio::readMetadata(uint8_t b, bool first) {

  static uint16_t pos_ml = 0;                          // determines the current position in metaline
  static uint16_t metalen = 0;
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (first) {
    pos_ml = 0;
    metalen = 0;
    return true;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (!metalen) {                                      // First byte of metadata?
    metalen = b * 16 + 1;                            // New count for metadata including length byte
    if (metalen > 512) {
      if (audio_info) audio_info("Metadata block to long! Skipping all Metadata from now on.");
      m_f_swm = true;                              // expect stream without metadata
    }
    pos_ml = 0; chbuf[pos_ml] = 0;                   // Prepare for new line
  }
  else {
    chbuf[pos_ml] = (char) b;                        // Put new char in +++++
    if (pos_ml < 510) pos_ml ++;
    chbuf[pos_ml] = 0;
    if (pos_ml == 509) {
      log_e("metaline overflow in AUDIO_METADATA! metaline=%s", chbuf);
    }
    if (pos_ml == 510) {
      ; /* last current char in b */
    }

  }
  if (--metalen == 0) {
    if (strlen(chbuf)) {                            // Any info present?
      // metaline contains artist and song name.  For example:
      // "StreamTitle='Don McLean - American Pie';StreamUrl='';"
      // Sometimes it is just other info like:
      // "StreamTitle='60s 03 05 Magic60s';StreamUrl='';"
      // Isolate the StreamTitle, remove leading and trailing quotes if present.
      // log_i("ST %s", metaline);

      latinToUTF8(chbuf, sizeof(chbuf)); // convert to UTF-8 if necessary

      int pos = indexOf(chbuf, "song_spot", 0);    // remove some irrelevant infos
      if (pos > 3) {                               // e.g. song_spot="T" MediaBaseId="0" itunesTrackId="0"
        chbuf[pos] = 0;
      }
      showstreamtitle(chbuf);   // Show artist and title if present in metadata
    }
    return true ;
  }
  return false;// end_METADATA
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::parseContentType(const char* ct) {
  bool ct_seen = false;
  if (indexOf(ct, "audio", 0) >= 0) {       // Is ct audio?
    ct_seen = true;                       // Yes, remember seeing this
    if (indexOf(ct, "mpeg", 13) >= 0) {
      m_codec = CODEC_MP3;
      AUDIO_INFO(sprintf(chbuf, "%s, format is mp3", ct);) //ok is likely mp3
      if (!MP3Decoder_AllocateBuffers()) {
        m_f_running = false;
        stopSong();
        return false;
      }
      AUDIO_INFO(sprintf(chbuf, "MP3Decoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
      InBuff.changeMaxBlockSize(m_frameSizeMP3);
    }
    else if (indexOf(ct, "mp3", 13) >= 0) {
      m_codec = CODEC_MP3;
      AUDIO_INFO(sprintf(chbuf, "%s, format is mp3", ct);)
      if (!MP3Decoder_AllocateBuffers()) {
        m_f_running = false;
        stopSong();
        return false;
      }
      AUDIO_INFO(sprintf(chbuf, "MP3Decoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
      InBuff.changeMaxBlockSize(m_frameSizeMP3);
    }
    else if (indexOf(ct, "aac", 13) >= 0) {     // audio/x-aac
      m_codec = CODEC_AAC;
      if (m_f_Log) {
        AUDIO_INFO(sprintf(chbuf, "%s, format is aac", ct);)
      }
      if (!AACDecoder_IsInit()) {
        if (!AACDecoder_AllocateBuffers()) {
          m_f_running = false;
          stopSong();
          return false;
        }
        AUDIO_INFO(sprintf(chbuf, "AACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
        InBuff.changeMaxBlockSize(m_frameSizeAAC);
      }
    }
    else if (indexOf(ct, "mp4", 13) >= 0) {     // audio/mp4a, audio/mp4a-latm
      m_codec = CODEC_M4A;
      if (m_f_Log) {
        AUDIO_INFO(sprintf(chbuf, "%s, format is aac", ct);)
      }
      if (!AACDecoder_IsInit()) {
        if (!AACDecoder_AllocateBuffers()) {
          m_f_running = false;
          stopSong();
          return false;
        }
        AUDIO_INFO(sprintf(chbuf, "AACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
        InBuff.changeMaxBlockSize(m_frameSizeAAC);
      }
    }
    else if (indexOf(ct, "m4a", 13) >= 0) {     // audio/x-m4a
      m_codec = CODEC_M4A;
      AUDIO_INFO(sprintf(chbuf, "%s, format is aac", ct);)
      if (!AACDecoder_IsInit()) {
        if (!AACDecoder_AllocateBuffers()) {
          m_f_running = false;
          stopSong();
          return false;
        }
        AUDIO_INFO(sprintf(chbuf, "AACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
        InBuff.changeMaxBlockSize(m_frameSizeAAC);
      }
    }
    else if (indexOf(ct, "wav", 13) >= 0) {     // audio/x-wav
      m_codec = CODEC_WAV;
      AUDIO_INFO(sprintf(chbuf, "%s, format is wav", ct);)
      InBuff.changeMaxBlockSize(m_frameSizeWav);
    }
    else if (indexOf(ct, "ogg", 13) >= 0) {
      m_codec = CODEC_OGG;
      AUDIO_INFO(sprintf(chbuf, "ContentType %s found", ct);)
    }
    else if (indexOf(ct, "flac", 13) >= 0) {    // audio/flac, audio/x-flac
      m_codec = CODEC_FLAC;
      AUDIO_INFO(sprintf(chbuf, "%s, format is flac", ct);)
      if (!psramFound()) {
        if (audio_info) audio_info("FLAC works only with PSRAM!");
        m_f_running = false;
        return false;
      }
      if (!FLACDecoder_AllocateBuffers()) {
        m_f_running = false;
        stopSong();
        return false;
      }
      InBuff.changeMaxBlockSize(m_frameSizeFLAC);
      AUDIO_INFO(sprintf(chbuf, "FLACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
    }
    else {
      m_f_running = false;
      sprintf(chbuf, "%s, unsupported audio format", ct);
      if (audio_fail_stream) audio_fail_stream(chbuf);
    }
  }
  if (indexOf(ct, "application", 0) >= 0) { // Is ct application?
    ct_seen = true;                       // Yes, remember seeing this
    uint8_t pos = indexOf(ct, "application", 0);
    if (indexOf(ct, "ogg", 13) >= 0) {
      m_codec = CODEC_OGG;
      AUDIO_INFO(sprintf(chbuf, "ContentType %s found", ct + pos);)
    }
  }
  return ct_seen;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::showstreamtitle(const char* ml) {
  // example for ml:
  // StreamTitle='Oliver Frank - Mega Hitmix';StreamUrl='www.radio-welle-woerthersee.at';
  // or adw_ad='true';durationMilliseconds='10135';adId='34254';insertionType='preroll';

  int16_t idx1, idx2;
  uint16_t i = 0, hash = 0;

  idx1 = indexOf(ml, "StreamTitle=", 0);
  if (idx1 >= 0) {                                                            // Streamtitle found
    idx2 = indexOf(ml, ";", idx1);
    char *sTit;
    if (idx2 >= 0) {
      sTit = strndup(ml + idx1, idx2 + 1);
      sTit[idx2] = '\0';
    }
    else          sTit =  strdup(ml);

