Loucotolo/ESP32-audioI2S/src/Audio.cpp
  m_pin_config.bck_io_num   = BCLK;
  m_pin_config.ws_io_num    = LRC; //  wclk
  m_pin_config.data_out_num = DOUT;
  m_pin_config.data_in_num  = DIN;

  const esp_err_t result = i2s_set_pin((i2s_port_t) m_i2s_num, &m_pin_config);
  return (result == ESP_OK);
}

//---------------------------------------------------------------------------------------------------------------------
bool Audio::setSampleRate(uint32_t sampRate) {
  if (!sampRate) sampRate = 16000; // fuse, if there is no value -> set default #209
  i2s_set_sample_rates((i2s_port_t)m_i2s_num, sampRate);
  m_sampleRate = sampRate;
  IIR_calculateCoefficients(m_gain0, m_gain1, m_gain2); // must be recalculated after each samplerate change
  return true;
}
uint32_t Audio::getSampleRate() {
  return m_sampleRate;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::setBitsPerSample(int bits) {
  if ((bits != 16) && (bits != 8)) return false;
  m_bitsPerSample = bits;
  return true;
}
uint8_t Audio::getBitsPerSample() {
  return m_bitsPerSample;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::setChannels(int ch) {
  if ((ch < 1) || (ch > 2)) return false;
  m_channels = ch;
  return true;
}
uint8_t Audio::getChannels() {
  if (m_channels == 0) {    // this should not happen! #209
    m_channels = 2;
  }
  return m_channels;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::setBitrate(int br) {
  m_bitRate = br;
  if (br)return true;
  return false;
}
uint32_t Audio::getBitRate(bool avg) {
  if (avg)
    return m_avr_bitrate;
  return m_bitRate;
}
//---------------------------------------------------------------------------------------------------------------------
[[deprecated]]void Audio::setInternalDAC(bool internalDAC /* = true */, i2s_dac_mode_t channelEnabled /* = I2S_DAC_CHANNEL_LEFT_EN */  ) {
  // is deprecated, set internal DAC in constructor e.g. Audio audio(true, I2S_DAC_CHANNEL_BOTH_EN);
  m_f_channelEnabled = channelEnabled;
  m_f_internalDAC = internalDAC;
  i2s_driver_uninstall((i2s_port_t)m_i2s_num);
  if (internalDAC)  {
    log_i("internal DAC");
    m_i2s_config.mode                 = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX | I2S_MODE_DAC_BUILT_IN );

#if ESP_ARDUINO_VERSION_MAJOR >= 2
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S); // vers >= 2.0.0
#else
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S_MSB);
#endif

    i2s_driver_install((i2s_port_t) m_i2s_num, &m_i2s_config, 0, NULL);
    // enable the DAC channels
    i2s_set_dac_mode(m_f_channelEnabled);
    if (m_f_channelEnabled != I2S_DAC_CHANNEL_BOTH_EN) {
      m_f_forceMono = true;
    }
  }
  else {  // external DAC
    m_i2s_config.mode                 = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);

#if ESP_ARDUINO_VERSION_MAJOR >= 2
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S); // vers >= 2.0.0
#else
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB);
#endif

    i2s_driver_install  ((i2s_port_t)m_i2s_num, &m_i2s_config, 0, NULL);
    i2s_set_pin((i2s_port_t) m_i2s_num, &m_pin_config);
  }
  // clear the DMA buffers
  i2s_zero_dma_buffer((i2s_port_t) m_i2s_num);
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::setI2SCommFMT_LSB(bool commFMT) {
  // false: I2S communication format is by default I2S_COMM_FORMAT_I2S_MSB, right->left (AC101, PCM5102A)
  // true:  changed to I2S_COMM_FORMAT_I2S_LSB for some DACs (PT8211)
  //        Japanese or called LSBJ (Least Significant Bit Justified) format

  if (commFMT) {
    log_i("commFMT LSB");

#if ESP_ARDUINO_VERSION_MAJOR >= 2
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_MSB); // v >= 2.0.0
#else
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_LSB);
#endif

  }
  else {
    log_i("commFMT MSB");

#if ESP_ARDUINO_VERSION_MAJOR >= 2
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S); // vers >= 2.0.0
#else
    m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB);
#endif

  }
  log_i("commFMT = %i", m_i2s_config.communication_format);
  i2s_driver_uninstall((i2s_port_t)m_i2s_num);
  i2s_driver_install  ((i2s_port_t)m_i2s_num, &m_i2s_config, 0, NULL);
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::playSample(int16_t sample[2]) {

  if (getBitsPerSample() == 8) { // Upsample from unsigned 8 bits to signed 16 bits
    sample[LEFTCHANNEL]  = ((sample[LEFTCHANNEL]  & 0xff) - 128) << 8;
    sample[RIGHTCHANNEL] = ((sample[RIGHTCHANNEL] & 0xff) - 128) << 8;
  }

  sample[LEFTCHANNEL]  = sample[LEFTCHANNEL]  >> 1; // half Vin so we can boost up to 6dB in filters
  sample[RIGHTCHANNEL] = sample[RIGHTCHANNEL] >> 1;

  // Filterchain, can commented out if not used
  sample = IIR_filterChain0(sample);
  sample = IIR_filterChain1(sample);
  sample = IIR_filterChain2(sample);
  //-------------------------------------------

  uint32_t s32 = Gain(sample); // vosample2lume;

  if (m_f_internalDAC) {
    s32 += 0x80008000;
  }

  esp_err_t err = i2s_write((i2s_port_t) m_i2s_num, (const char*) &s32, sizeof(uint32_t), &m_i2s_bytesWritten, 1000);
  if (err != ESP_OK) {
    log_e("ESP32 Errorcode %i", err);
    return false;
  }
  if (m_i2s_bytesWritten < 4) {
    log_e("Can't stuff any more in I2S..."); // increase waitingtime or outputbuffer
    return false;
  }
  return true;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::setTone(int8_t gainLowPass, int8_t gainBandPass, int8_t gainHighPass) {
  // see https://www.earlevel.com/main/2013/10/13/biquad-calculator-v2/
  // values can be between -40 ... +6 (dB)

  m_gain0 = gainLowPass;
  m_gain1 = gainBandPass;
  m_gain2 = gainHighPass;

  IIR_calculateCoefficients(m_gain0, m_gain1, m_gain2);

