Loucotolo/ESP32-audioI2S/src/Audio.cpp
  //    log_i("LS a0=%f, a1=%f, a2=%f, b1=%f, b2=%f", m_filter[0].a0, m_filter[0].a1, m_filter[0].a2,
  //                                                  m_filter[0].b1, m_filter[0].b2);
  //    log_i("EQ a0=%f, a1=%f, a2=%f, b1=%f, b2=%f", m_filter[1].a0, m_filter[1].a1, m_filter[1].a2,
  //                                                  m_filter[1].b1, m_filter[1].b2);
  //    log_i("HS a0=%f, a1=%f, a2=%f, b1=%f, b2=%f", m_filter[2].a0, m_filter[2].a1, m_filter[2].a2,
  //                                                  m_filter[2].b1, m_filter[2].b2);
}
//---------------------------------------------------------------------------------------------------------------------
int16_t* Audio::IIR_filterChain0(int16_t iir_in[2], bool clear) { // Infinite Impulse Response (IIR) filters

  uint8_t z1 = 0, z2 = 1;
  enum : uint8_t {in = 0, out = 1};
  float inSample[2];
  float outSample[2];
  static int16_t iir_out[2];

  if (clear) {
    memset(m_filterBuff, 0, sizeof(m_filterBuff));            // zero IIR filterbuffer
    iir_out[0] = 0;
    iir_out[1] = 0;
    iir_in[0]  = 0;
    iir_in[1]  = 0;
  }

  inSample[LEFTCHANNEL]  = (float)(iir_in[LEFTCHANNEL]);
  inSample[RIGHTCHANNEL] = (float)(iir_in[RIGHTCHANNEL]);

  outSample[LEFTCHANNEL] =   m_filter[0].a0  * inSample[LEFTCHANNEL]
                             + m_filter[0].a1  * m_filterBuff[0][z1][in] [LEFTCHANNEL]
                             + m_filter[0].a2  * m_filterBuff[0][z2][in] [LEFTCHANNEL]
                             - m_filter[0].b1  * m_filterBuff[0][z1][out][LEFTCHANNEL]
                             - m_filter[0].b2  * m_filterBuff[0][z2][out][LEFTCHANNEL];

  m_filterBuff[0][z2][in] [LEFTCHANNEL]  = m_filterBuff[0][z1][in][LEFTCHANNEL];
  m_filterBuff[0][z1][in] [LEFTCHANNEL]  = inSample[LEFTCHANNEL];
  m_filterBuff[0][z2][out][LEFTCHANNEL]  = m_filterBuff[0][z1][out][LEFTCHANNEL];
  m_filterBuff[0][z1][out][LEFTCHANNEL]  = outSample[LEFTCHANNEL];
  iir_out[LEFTCHANNEL] = (int16_t)outSample[LEFTCHANNEL];


  outSample[RIGHTCHANNEL] =  m_filter[0].a0 * inSample[RIGHTCHANNEL]
                             + m_filter[0].a1 * m_filterBuff[0][z1][in] [RIGHTCHANNEL]
                             + m_filter[0].a2 * m_filterBuff[0][z2][in] [RIGHTCHANNEL]
                             - m_filter[0].b1 * m_filterBuff[0][z1][out][RIGHTCHANNEL]
                             - m_filter[0].b2 * m_filterBuff[0][z2][out][RIGHTCHANNEL];

  m_filterBuff[0][z2][in] [RIGHTCHANNEL] = m_filterBuff[0][z1][in][RIGHTCHANNEL];
  m_filterBuff[0][z1][in] [RIGHTCHANNEL] = inSample[RIGHTCHANNEL];
  m_filterBuff[0][z2][out][RIGHTCHANNEL] = m_filterBuff[0][z1][out][RIGHTCHANNEL];
  m_filterBuff[0][z1][out][RIGHTCHANNEL] = outSample[RIGHTCHANNEL];
  iir_out[RIGHTCHANNEL] = (int16_t) outSample[RIGHTCHANNEL];

  return iir_out;
}
//---------------------------------------------------------------------------------------------------------------------
int16_t* Audio::IIR_filterChain1(int16_t iir_in[2], bool clear) { // Infinite Impulse Response (IIR) filters

  uint8_t z1 = 0, z2 = 1;
  enum : uint8_t {in = 0, out = 1};
  float inSample[2];
  float outSample[2];
  static int16_t iir_out[2];

  if (clear) {
    memset(m_filterBuff, 0, sizeof(m_filterBuff));            // zero IIR filterbuffer
    iir_out[0] = 0;
    iir_out[1] = 0;
    iir_in[0]  = 0;
    iir_in[1]  = 0;
  }

  inSample[LEFTCHANNEL]  = (float)(iir_in[LEFTCHANNEL]);
  inSample[RIGHTCHANNEL] = (float)(iir_in[RIGHTCHANNEL]);

  outSample[LEFTCHANNEL] =   m_filter[1].a0  * inSample[LEFTCHANNEL]
                             + m_filter[1].a1  * m_filterBuff[1][z1][in] [LEFTCHANNEL]
                             + m_filter[1].a2  * m_filterBuff[1][z2][in] [LEFTCHANNEL]
                             - m_filter[1].b1  * m_filterBuff[1][z1][out][LEFTCHANNEL]
                             - m_filter[1].b2  * m_filterBuff[1][z2][out][LEFTCHANNEL];

  m_filterBuff[1][z2][in] [LEFTCHANNEL]  = m_filterBuff[1][z1][in][LEFTCHANNEL];
  m_filterBuff[1][z1][in] [LEFTCHANNEL]  = inSample[LEFTCHANNEL];
  m_filterBuff[1][z2][out][LEFTCHANNEL]  = m_filterBuff[1][z1][out][LEFTCHANNEL];
  m_filterBuff[1][z1][out][LEFTCHANNEL]  = outSample[LEFTCHANNEL];
  iir_out[LEFTCHANNEL] = (int16_t)outSample[LEFTCHANNEL];


  outSample[RIGHTCHANNEL] =  m_filter[1].a0 * inSample[RIGHTCHANNEL]
                             + m_filter[1].a1 * m_filterBuff[1][z1][in] [RIGHTCHANNEL]
                             + m_filter[1].a2 * m_filterBuff[1][z2][in] [RIGHTCHANNEL]
                             - m_filter[1].b1 * m_filterBuff[1][z1][out][RIGHTCHANNEL]
                             - m_filter[1].b2 * m_filterBuff[1][z2][out][RIGHTCHANNEL];

  m_filterBuff[1][z2][in] [RIGHTCHANNEL] = m_filterBuff[1][z1][in][RIGHTCHANNEL];
  m_filterBuff[1][z1][in] [RIGHTCHANNEL] = inSample[RIGHTCHANNEL];
  m_filterBuff[1][z2][out][RIGHTCHANNEL] = m_filterBuff[1][z1][out][RIGHTCHANNEL];
  m_filterBuff[1][z1][out][RIGHTCHANNEL] = outSample[RIGHTCHANNEL];
  iir_out[RIGHTCHANNEL] = (int16_t) outSample[RIGHTCHANNEL];

  return iir_out;
}
//---------------------------------------------------------------------------------------------------------------------
int16_t* Audio::IIR_filterChain2(int16_t iir_in[2], bool clear) { // Infinite Impulse Response (IIR) filters

  uint8_t z1 = 0, z2 = 1;
  enum : uint8_t {in = 0, out = 1};
  float inSample[2];
  float outSample[2];
  static int16_t iir_out[2];

  if (clear) {
    memset(m_filterBuff, 0, sizeof(m_filterBuff));            // zero IIR filterbuffer
    iir_out[0] = 0;
    iir_out[1] = 0;
    iir_in[0]  = 0;
    iir_in[1]  = 0;
  }

  inSample[LEFTCHANNEL]  = (float)(iir_in[LEFTCHANNEL]);
  inSample[RIGHTCHANNEL] = (float)(iir_in[RIGHTCHANNEL]);

  outSample[LEFTCHANNEL] =   m_filter[2].a0  * inSample[LEFTCHANNEL]
                             + m_filter[2].a1  * m_filterBuff[2][z1][in] [LEFTCHANNEL]
                             + m_filter[2].a2  * m_filterBuff[2][z2][in] [LEFTCHANNEL]
                             - m_filter[2].b1  * m_filterBuff[2][z1][out][LEFTCHANNEL]
                             - m_filter[2].b2  * m_filterBuff[2][z2][out][LEFTCHANNEL];

  m_filterBuff[2][z2][in] [LEFTCHANNEL]  = m_filterBuff[2][z1][in][LEFTCHANNEL];
  m_filterBuff[2][z1][in] [LEFTCHANNEL]  = inSample[LEFTCHANNEL];
  m_filterBuff[2][z2][out][LEFTCHANNEL]  = m_filterBuff[2][z1][out][LEFTCHANNEL];
  m_filterBuff[2][z1][out][LEFTCHANNEL]  = outSample[LEFTCHANNEL];
  iir_out[LEFTCHANNEL] = (int16_t)outSample[LEFTCHANNEL];


  outSample[RIGHTCHANNEL] =  m_filter[2].a0 * inSample[RIGHTCHANNEL]
                             + m_filter[2].a1 * m_filterBuff[2][z1][in] [RIGHTCHANNEL]
                             + m_filter[2].a2 * m_filterBuff[2][z2][in] [RIGHTCHANNEL]
                             - m_filter[2].b1 * m_filterBuff[2][z1][out][RIGHTCHANNEL]
                             - m_filter[2].b2 * m_filterBuff[2][z2][out][RIGHTCHANNEL];

  m_filterBuff[2][z2][in] [RIGHTCHANNEL] = m_filterBuff[2][z1][in][RIGHTCHANNEL];
  m_filterBuff[2][z1][in] [RIGHTCHANNEL] = inSample[RIGHTCHANNEL];
  m_filterBuff[2][z2][out][RIGHTCHANNEL] = m_filterBuff[2][z1][out][RIGHTCHANNEL];
  m_filterBuff[2][z1][out][RIGHTCHANNEL] = outSample[RIGHTCHANNEL];
  iir_out[RIGHTCHANNEL] = (int16_t) outSample[RIGHTCHANNEL];

  return iir_out;
}
